[
    {
        "title": "Verilog port mapping when a gate netlist module's vector ports instatantiated inside an rtl module have been split into each bit by P&R tool",
        "question": "I have to run an rtl simulation where all the source codes are verilog (system verilog) files but a module of my interest is a gate netlist module. Of course I have to put some wire delays around the instantiated gate netlist module to avoid timing errors. The problem is, the netlist module's input and output ports have been all split into separate bits by the placement and route tool(it went through some ECO operation). So originally the module definition started like :\n```\nmodule abc (\ninput [15:0] a;\noutput [7:0] b;\n..\n```\n\nbut now it has become\n```\nmodule abc (\ninput \\a[15] ;\ninput \\a[14] ;\ninput \\a[13] ;\ninput \\a[12] ;\ninput \\a[11] ;\n...\noutput \\b[7] ;\noutput \\b[6] ;\noutput \\b[5] ;\noutput \\b[4] ;\n...\n```\n\nNow, in the module \"eee\" which instantiates the module \"abc\", I used to have it like\n```\nwire [15:0] sig_a;\nwire [7:0] sig_b;\nabc u_abc (\n.a(sig_a),\n.b(sig_b),\n...\n```\n\nBut I cannot do the same because the compiler complains about it.Port name 'a' of instance 'tb_aaa.bbb.ccc.ddd.eee' is invalid or has\nmultiple connections and the instantiated module is defined in file\nabc_gate.vI tried usinggeneratefor the port mapping of each bit but it looks like verilog doesn't allow generate statements for each group of port mapping. I don't want to modify the netlist. How can I solve this?",
        "accepted_answer": "Some synthesis tools can be configured to preserve module port names such that the synthesized Verilog code matches the RTL code (for the port list).  Refer to the Cadence documentation or contact Cadence.If that is not a possibility, it is standard practice to handle pre-/post-synthesis differences by using Verilog macros.  For example, in your Verilog code, you can define a macro such asGATESto conditionally instantiate theabcmodule:`ifdef GATES\n    abc abc ( /* netlist port names here */ );\n`else\n    abc abc ( /* RTL port names here */ );\n`endif",
        "all_answers": []
    },
    {
        "title": "Is there a way to write SKILL script where LVS report file (generated in .lvs.report ) can be written to .csv file",
        "question": "Is there a way to write SKILL script where LVS report file (generated in .lvs.report ) can be written to .csv file ?I am trying to write a SKILL script wherein I can copy the lvs.report file data to .csv file\nI want to firstly read the file and then copy the data to a .csv fileI tried using inPort to read the file but it doesnt seem to work.",
        "accepted_answer": "To read a file you can do something like this:inPort = infile( \"filename\" )\nwhile( gets( nextLine inPort )\n    printf(\"%s\" nextLine)\n)\nclose(inPort)To write a file you can do:op=outfile(\"filename\" \"w\")\nfprintf(op \"%s %s\\n\" net1 net2)\nclose(op)",
        "all_answers": []
    },
    {
        "title": "Cadence detection API for Samsung Galaxy Watch 6 (Wear OS)?",
        "question": "Is there any other Cadence API for Wear OS?\nI'm trying to calculate running cadence and display the information on the UI, but I have no idea how to do it.\nI foundval RUNNING_STEPS: DeltaDataType<Long,IntervalDataPoint<Long>>is it can use in real time ?The Google Fit API does not suit me.I tried to write an algorithm using the accelerometer but failed.",
        "accepted_answer": null,
        "all_answers": [
            "In the ExerciseClient of Android Health Services API you can monitor the STEPS_PER_MINUTE data type. That is what cadence is."
        ]
    },
    {
        "title": "Cannot find workflow definition even though I register it to worker",
        "question": "I'm registering two workflows to my Cadence worker based on Spring Boot. However, even though I successfully register all my workflows and start the worker, I'm only able to use one workflow. Here is a code snippet.\n```\n@Configuration\npublic class CadenceAutoConfiguration {\n  @Bean\n  public WorkflowClient workflowClient() {\n    return WorkflowClient.newInstance(\n        new WorkflowServiceTChannel(ClientOptions.defaultInstance()),\n        WorkflowClientOptions.newBuilder().setDomain(DOMAIN).build());\n  }\n\n  @EventListener(ApplicationStartedEvent.class)\n  public void startWorker(ApplicationStartedEvent event) {\n    System.out.println(\"Starting workers\");\n    ApplicationContext context = event.getApplicationContext();\n    WorkflowClient workflowClient = context.getBean(WorkflowClient.class);\n    WorkerFactory factory = WorkerFactory.newInstance(workflowClient);\n    Worker worker = factory.newWorker(TASK_LIST);\n\n    worker.registerWorkflowImplementationTypes(WorkflowA.class);\n    worker.registerWorkflowImplementationTypes(WorkflowB.class);\n    worker.registerWorkflowImplementationTypes(WorkflowC.class);\n    factory.start();\n  }\n}\n```\n\nI'm only able to useWorkflowC. When I try to invokeWorkflowAandWorkflowB, I gotworkflow definition not found error. Wonder how to fix the issue?Tried to restart the worker and Cadence server but didn't work",
        "accepted_answer": "The problem comes from theworker.registerWorkflowImplementationTypes. This method takes a varag as an input argument and every time this method is called, it will override the previous calls. In this example, the worker will only haveWorkflowCregistered because the first two calls are overridden.The correct way to register the implementation class is passing all classes into this method by doing something likeworker.registerWorkflowImplementationTypes(WorkflowC.class, WorkflowB.class, WorkflowC.class);This will make sure all workflow classes are loaded to the worker at once.",
        "all_answers": []
    },
    {
        "title": "Extra character after close-quote",
        "question": "I am running the below command in MATLAB. This code is basically launching cadence xcelium simulator in gui mode using the commandnclaunch.  nclaunch opens the xterm and from there it should launch xcelium simulator but befor that I am getting the error.\n```\ntclcmds = {  'exec xmvhdl -64bit osc_filter.vhd simple_osc.vhd osc_top.vhd',...\n             'exec xmelab -64bit -access +wc osc_top',...\n             ['hdlsimmatlab -gui osc_top -64bit ', ...\n              ' -input \"{@matlabcp :u_osc_filter -mfunc oscfilter}\"',...\n              ' -input \"{@force clk_enable {\"1\"} -after 0ns}\"',...\n              ' -input \"{@force reset {\"0\"} -after 0ns {\"1\"} -after 40ns {\"0\"} -after 120ns}\"',...\n              ' -input \"{@force clk {\"1\"} -after 0ns {\"0\"} -after 40ns -repeat 80ns}\"',...\n              ' -input \"{@simvision  {set w \\[waveform new\\]}}\"',...\n              ' -input \"{@simvision  {waveform add -using \\$w -signals :clk_enable}}\"',...\n              ' -input \"{@simvision  {waveform add -using \\$w -signals :clk}}\"',...\n              ' -input \"{@simvision  {waveform add -using \\$w -signals :reset}}\"',...\n              ' -input \"{@simvision  {waveform add -using \\$w -signals signed(:osc_out)}}\"',...\n              ' -input \"{@simvision  {waveform add -using \\$w -signals signed(:filter8x_out)}}\"',...\n              ' -input \"{@simvision  {waveform format -using \\$w signed(:osc_out) -trace analogSampleAndHold}}\"',...\n              ' -input \"{@simvision  {waveform format -using \\$w signed(:filter8x_out) -trace analogSampleAndHold}}\"',...\n              ' -input \"{@simvision  {waveform axis range -min -50000 -max 50000 -using \\$w signed(:osc_out)}}\"',...\n              ' -input \"{@simvision  {waveform axis range -min -1.5e6 -max 1.5e6 -using \\$w signed(:filter8x_out)}}\"',...  \n              ' -input \"{@database -open waves -into waves.shm -default}\"',...\n              ' -input \"{@probe -create -shm :clk_enable :clk :reset :osc_out :filter8x_out}\"',...\n              ' -input \"{@run 10000ns}\"'\n             ]};\nnclaunch('tclstart',tclcmds);\n```\n\nAfter running above command I am getting following errorextra characters after close-quoteI am not sure about this error.",
        "accepted_answer": "It looks like the double quotes in these strings are not interpreted the way you expect:' -input \"{@force clk_enable {\"1\"} -after 0ns}\"',...\n' -input \"{@force reset {\"0\"} -after 0ns {\"1\"} -after 40ns {\"0\"} -after 120ns}\"',...\n' -input \"{@force clk {\"1\"} -after 0ns {\"0\"} -after 40ns -repeat 80ns}\"',...Fore example the first string probably gets interpreted as following parts:-input\" - open-quote{@force clk_enable { - a string in quotes\" - close-quote1\"} -after 0ns}\" - extra characters after close-quoteI would suggest trying to:remove those string to make sure the error disappearstrying to escape the quotes - probably instead of {\"1\"} typing {\\\"1\\\"} or something similar, see this question for discussionHow can I escape a double quote inside double quotes?",
        "all_answers": []
    },
    {
        "title": "Flow Cadence: How to generate a random integer between two integer?",
        "question": "I tried unsafeRandom and this custom smart-contract without success:https://github.com/justjoolz/PRNG/blob/master/cadence/contracts/PRNG.cdc",
        "accepted_answer": null,
        "all_answers": [
            "As mentioned by @j00lz, you can create a random between two integers (more specificallyUInt256types) by using thePRNGcontract foundhere.Essentially, you create a Generator resource based on a seed (or block height + integer), and call functions on that generator.Here is a helpful example of how to use it (try it outhere):\n```\nimport PRNG from 0x93615d25d14fa337\n\npub fun main(min: UInt256, max: UInt256): UInt256 {\n  // create the generator resource\n  let generator <- PRNG.createFrom(blockHeight: getCurrentBlock().height, uuid: 100)\n\n  // call the range function to give you an integer between min and max\n  let answer: UInt256 = generator.range(min, max)\n\n  // destroy the generator resource\n  destroy generator\n\n  // return your answer\n  return answer\n}\n```\n\n"
        ]
    },
    {
        "title": "Copying Lists using Keeps in Specman",
        "question": "Currently if I want to generate an identical list to a previously generated one in Specman e I use:\n```\n<'\nstruct A {\n    ListA : list of uint;\n    keep ListA.size() == 5;\n    keep ListA.sum(it) <= 20;\n};\n\nstruct B {\n    ListB : list of uint;\n};\n\nextend sys {\n    A1 : A;\n    B1 : B;\n\n    // Keeps\n    keep B1.B.size() == read_only(A1.A.size());\n    keep for each in B1.B {\n        it == read_only(A1.A[index]);\n    };\n};\n'>\n```\n\nIs there a cleaner way to have this generation? A one line keep?",
        "accepted_answer": null,
        "all_answers": [
            "You could say:\n```\nkeep B1.ListB == A1.ListA.copy();\n```\n\nBut using the generator to create an exact copy is very inefficient. In the end, there is nothing to generate...\nInstead, use a simple assignment.\n```\nextend sys {\n...\npost_generate is also {\n   B1.B = A1.A.copy(); // shallow copy OK for uints, use deep_copy() when appropriate\n   }\n}\n```\n\nDepending on other members, you might not even have to generate B1 at all."
        ]
    },
    {
        "title": "Generating a list in Specman with at least one of each enum",
        "question": "If I have:\n```\n<'\ntype MyEnum : [A1, B2, C3, D4, E5];\n\nextend sys {\n     ListA : list of MyEnum;\n     keep ListA.size() == 10; // Just for the example,\n                              // point being that it is larger than the number of Enums in the type\n};\n'>\n```\n\nHow do I add keeps to haveListAgenerate withat least oneof each enum?I want this to happen in generation so preferably not to do this on-the-fly.\nI can add:\n```\nextend sys {\n     keep ListA.has(it == A1);\n     keep ListA.has(it == B2);\n     ...\n};\n```\n\nBut there must be a better way. This also isn't helpful if I start adding more to the type.I also want all of them to be random so having a keep on the first 5 elements that they should be all different isn't as helpful either.Thank you!",
        "accepted_answer": null,
        "all_answers": [
            "i also use an auxiliary list:\n```\nall_vals : list of MyEnum;\nkeep all_vals == all_values(MyEnum);\nkeep for each in all_vals {\n    it in ListA;\n};\n```\n\n"
        ]
    },
    {
        "title": "Does updating/redeploying a smart contract on Flow reset its state on mainnet?",
        "question": "Following this official guide herehttps://developers.flow.com/flow/dapp-development/mainnet-deployment#updatere-deploy-a-contract-on-mainnet-using-the-cliI would like to make some updates to a smart contract I've got on Mainnet and there's a bunch of existing NFTs in there in an array that lives on the contract, would updating the contract via the CLI following the guide above just... erase those NFTs and reset the contract's data?",
        "accepted_answer": "Great question! Updating a contract only updates the code deployed in the contract. It does not update any objects or other state stored in the contract. This is why you can't do any updates to a contract such as adding or removing fields, changing the type of a field, and other such changes. See the upgrade docs for more information:https://developers.flow.com/cadence/language/contract-updatability",
        "all_answers": []
    },
    {
        "title": "field `accessory` of type `Transaction` is not invalidated (moved or destroyed). not invalidated - flow cadence",
        "question": "I'm developing a game and I have an avatar resource with the following definition that stores accessory NFTs and includes an equip function that returns any accessory that was existing in the slot\n```\npub resource Avatar {\n        pub let id: UInt64\n        pub let accessories: @{String: Accessory}\n\n        init() {\n            self.id = Avatar.totalMinted + 1\n            self.accessories <- {}\n\n            Avatar.totalMinted = Avatar.totalMinted + 1\n        }\n\n        destroy () {\n            Avatar.totalAvatars = Avatar.totalAvatars - 1\n            destroy self.accessories\n        }\n\n        pub fun equip(accessory: @Accessory): @Accessory? {\n            // Shift accessory into accessories dictionary and return old accessory\n            let oldAccessory <- self.accessories[accessory.getAccessoryData().slot] <- accessory\n            return <- oldAccessory\n\n        }\n}\n```\n\nNow in my transaction I get the accessory from my collection and equip it, making sure i deposit the old accessory in the slot if that exists.\n```\nimport Avatar from 0x03\nimport NonFungibleToken from 0x01\ntransaction(avatarId: UInt64, accessoryId: UInt64) {\n    \n    let collection: &Avatar.Collection\n    let avatar: auth &Avatar.Avatar\n    let accessory: @Avatar.Accessory\n\n    prepare(signer: AuthAccount) {\n        self.collection = signer.borrow<&Avatar.Collection>(from: Avatar.CollectionStoragePath) ?? panic(\"could not borrow collection\")\n        self.avatar = self.collection.borrowAuth(id: avatarId) as? auth &Avatar.Avatar ?? panic(\"problem\")\n        self.accessory <- self.collection.withdraw(withdrawID: accessoryId) as! @Avatar.Accessory\n    }\n\n    execute {\n        if let oldAccessory <- self.avatar.equip(accessory: <- self.accessory) {\n            self.collection.deposit(token: <- oldAccessory)\n        }\n\n    }\n}\n```\n\nI get the error fieldaccessoryof typeTransactionis not invalidated (moved or destroyed). not invalidated - flow cadenceI have a feeling the type checker may not understand that the resource should be moved/destroyed by the end of this but maybe it's confused since it hands over the custody to Avatar.Am I missing something?",
        "accepted_answer": null,
        "all_answers": [
            "Have you tried not using if let here? I am not sure that the compiler is smart enough to understand that the return from equip is nil even though you use if let"
        ]
    },
    {
        "title": "How do you make a resource self-destruct on flow / cadence?",
        "question": "I would like for a resource to have a function where at the end of the function it self destructs by callingdestroy self\n```\npub resource SelfDestructingConsumable {\n  pub fun consume() {\n    // do some stuff\n    destroy self\n  }\n}\n```\n\nThe type checker complains that this is illegalCannot destroyselfI'm wondering if anyone has any creative ways around this? I have a feeling that maybe it should be wrapped in some sort ofConsumableCollectionorConsumableManagerlike so\n```\npub resource ConsumableCollection {\n  pub let consumables: @{UInt64: SelfDestructingConsumable}\n  pub fun consume(id: UInt64) {\n    let consumable <- consumables.remove(id)\n    // do some stuff\n    destroy consumable\n  }\n}\n```\n\nBut i feel that it makes more sense to be able to just use a consumable and have it independently self destruct.I'd like to get some thoughts or ideas on a better way to do this.",
        "accepted_answer": "You do need to create a wrapper around it in order to destroy like you have suggested. Some use cases also do this in a transaction itself. It depend upon your usecase, would also strongly suggest emitting an Burned event or something when you do so as it is a good practise to always emit events on state changes.",
        "all_answers": []
    },
    {
        "title": "Web(GUI) based workflow platform for multi-tenant model",
        "question": "I'm looking at creating a web-based workflow platform that meets the following requirements.Aworkflowis a DAG of steps available in the user interface and can be stored as a JSON or YAMLSteps: Tasks or functions,  can take input as well as output from prior steps, these tasks can be I/O or CPU bound.Create a workflow by dragging and dropping steps from a web UI.All programming options, such as skip or execute on condition, loop on items, and so on, should be supported by steps.allows for a halt for approval and then a resume.Multi tenancy supportscalableguaranteed executionThese workflow should be able to trigger/schedule from UIFor the above requirement, I have been exploring various open-source workflow engines and narrowed down my choice tocadence and kestraBut I am still not sure whether I should design a workflow engine from scratch  or should be dependent on an open-source option considering my requirement.\nIs cadence a good choice if I want to move ahead for my requirement",
        "accepted_answer": null,
        "all_answers": [
            "I would recommend starting with an open-source project as it seems easier than starting from scratch. Kestra satisfies all the above-mentioned criteria. I currently work there and happy to answer questions. If some features you need are lacking, we are open to feature requests and feedback - you can open an issue on GitHubhttps://github.com/kestra-io/kestra"
        ]
    },
    {
        "title": "Integrating Flow Blockchain in Flutter",
        "question": "I am trying to develop a dAPP using theFlow Blockchainin Flutter. I cannot find any library or package that I can use to do so. Is this even possible in Flutter?",
        "accepted_answer": null,
        "all_answers": [
            "You could use flutters HTTP library to make requests to FlowsREST API",
            "I started to work on aFlow Dart SDKquite a long time ago.\nThe REST API was not available at that time, but you could still do calls via GRPC requests. Check it out - maybe it's something you would be interested in collaborating and we can bring it to finished state."
        ]
    },
    {
        "title": "Reading cmd arguments in TCL file",
        "question": "I am trying to run a tcl script through .bat file. I want to read some cmd arguments in the tcl script. Below is my code:Command to run:\n```\nD:\\Cadence\\Sigrity2021.1\\tools\\bin\\PowerSI.exe -tcl abcd.tcl %new_var%.spd %new_file_name%\n```\n\nBelow is how I am trying to read the variable in the tcl file:\n```\nsigrity::open document [lindex $argv 0] {!}\n```\n\nIt open up the Cadence Sigrity, but  I see the below error:How do I read cmd argument in tcl?",
        "accepted_answer": null,
        "all_answers": [
            "If you have no other way to do it that you can find (and it sounds like that might be the case) then you can fake it by writing a helper file with content like this, filling in the real arguments in the appropriate places:\n```\n# Name of script to call\nset ::argv0 \"abcd.tcl\"\n# Arguments to pass\nset ::argv {}\nlappend ::argv \"%new_var%.spd\"\nlappend ::argv \"%new_file_name%\"\n# Number of arguments (rarely used)\nset ::argc [llength $::argv]\n# Do the call\nsource $::argv0\n```\n\nThen you can pass that file toPowerSIand it will set things up and chain to the real file. It's messy, but practical.If you're writing this from Tcl, use thelistcommand to do the quoting of the strings (instead of putting them in double quotes) as it will do exactly the right thing for you. If you're writing the file from another language, you'll want to make sure you put backslashes in before\\,\",$and[characters. The fiddlyness of doing that depends on your language."
        ]
    },
    {
        "title": "Xcelium simulator in endless loop using Tcl for/while",
        "question": "Could someone help me to understand why the below code hangs (i.e. stuck in an endless loop) in Xcelium simulator, and what should be the correct one?\n```\nfor {set i 0} {$i < 2} {incr $i} { puts \"i is $i\"; }\n```\n\n\n```\nset i 0\nwhile {$i < 2} { puts \"i is $i\"; incr $1; }\n```\n\nThe result for eitherfororwhileloop above is just an endless:i is 0",
        "accepted_answer": null,
        "all_answers": [
            "incrtakes a variable name as input argument, so it should beincr i.incr $iincrements instead the variable0. What happens if the variable does not exist depends on Tcl version.From the manual page:Starting with the Tcl 8.5 release, the variable varName passed to incr may be unset, and in that case, it will be set to the value increment or to the default increment value of 1."
        ]
    },
    {
        "title": "Is there a way for a SKILL script to find and replace parts on schematic?",
        "question": "I am trying to write a SKILL script that replaces parts on a schematic given a csv file with the original part, and the desired replacement. So far I have looked through theIntro to Skill Programming. I only see information about file I/O and nothing, to my knowledge, that would allow the script to find and replace parts in the schematic.",
        "accepted_answer": "You should register on the Cadence support sitehttps://support.cadence.com/There is a lot of information and examples on the site.\nBelow is just an example of how to find and update instances in schematicprocedure(ATUpdateSchematicInstances(libName cellName viewName updateTable @optional (ignoreErrors nil))\n        let( (cvId instList instOldLib instOldCell key destLibName destCellName vicViewList instOldView updateResult errorInstList)\n            \n            cvId=dbOpenCellViewByType(libName cellName viewName \"schematic\" \"a\")\n            instList=cvId~>instHeaders\n            foreach(inst instList\n                instOldLib=inst->libName\n                instOldCell=inst->cellName\n                instOldView=inst->viewName\n    \n                key=ATCreateCellInfo(instOldLib instOldCell)\n    \n                when(updateTable[key]\n                    destLibName=updateTable[key]->libName\n                    destCellName=updateTable[key]->cellName\n                    \n                    updateResult=dbSetInstHeaderMasterName(inst destLibName destCellName instOldView)\n                );when\n            );foreach\n            \n            schCheck(cvId)\n            dbSave(cvId)\n            dbClose(cvId)\n        );let\n\n);procedure ATUpdateSchematicInstances",
        "all_answers": []
    },
    {
        "title": "Is there a quicker way to get workflowHistory",
        "question": "we use cadence 0.11In our project, there is an often used service which needs the workflowHistory.So we have to call this function oftenly:\n```\nGetWorkflowHistory(ctx context.Context, workflowID string, runID string, isLongPoll bool, filterType s.HistoryEventFilterType) HistoryEventIterator\n```\n\nThe problem is, the function calling is quite slow and it makes our service quite slow. What's more, we must ensure the correctness of the workflow so we can not use cache since cache cannot store data which updates frequently.Is there a quicker way for us to get workflowHistory? maybe a new api, or some new configurations in cadence?",
        "accepted_answer": null,
        "all_answers": [
            "There is no faster way to get the history. The latency depends on the length and size of the history. This is a critical api in Cadence so the perf has been optimized to the best within its architecture.However, based on your use case, this is a misuse of the api. You should implement Query handler for the workflow. Worker will do everything same as you are doing to parse history.If preferred, you can implement a very generic Query handler which return almost everything in the workflow events. So that only one Query handler can let you get anything like getting from the history. Specifically, you can put all signals, activity input output etc into a list and return the list as the query results.Using worker query will save the latency for you. This is because Cadence worker would cache the history. When there is no changes on the workflow it will not get any more history from server. when new events are appended, only delta of events will be transported between the worker and server. Therefore the latency is minimum regardless of the length of the history.The only case that worker will need to reload the whole  history is when cache is evicted or worker restart. so it’s always recommended to keep history short so that it won’t cost too much resources in that case.See more docs about query.https://cadenceworkflow.io/docs/concepts/queries/#stack-trace-queryGolanghttps://cadenceworkflow.io/docs/go-client/queries/Javahttps://cadenceworkflow.io/docs/java-client/queries/Taking Golang as an example, if you want to return activity result as the query output:\n```\nfunc MyWorkflow(ctx workflow.Context, input string) error {\n    var res map[string]string \n    err := workflow.SetQueryHandler(ctx, \"current_state\", func() (map[string]string, error) {\n        return res, nil\n    })\n    \n    ctx = workflow.WithActivityOptions(ctx, ...)\n    var act_out string \n    err = workflow.ExecuteActivity(ctx, ActivityA, \"my_input\").Get(ctx, &act_out)\n    if err != nil {\n        res[\"ActivityA\"] = act_out\n        return err\n    }\n    return nil\n}\n```\n\n"
        ]
    },
    {
        "title": "Temporal/Cadence performance tuning",
        "question": "Could anyone help me understand the following situation.\nI have 1 worker with the configuration:\n```\nworkerOptions := worker.Options{\n    BackgroundActivityContext:               ctx,\n    MaxConcurrentWorkflowTaskPollers:        10,\n    MaxConcurrentActivityTaskPollers:        20,\n    MaxConcurrentWorkflowTaskExecutionSize:  256,\n    MaxConcurrentLocalActivityExecutionSize: 256,\n    MaxConcurrentActivityExecutionSize:      256,\n```\n\nIf I set MaxConcurrentWorkflowTaskExecutionSize and MaxConcurrentActivityExecutionSize to 1024, the worker starts to work too slowly. I thought that increasing these two options will help to handle more Activities and WorkflowTasks, but it works differently.\nThe worker has enough CPU/RAM and he is not overloaded at all.From the Temporal UI I was able to catch that some of workflows freeze for some time in such history state:\n```\n1 WorkflowExecutionStarted Aug 10th 10:40:17 am CLOSE TIMEOUT 30m\n2 WorkflowTaskScheduled Aug 10th 10:40:17 am TASKQUEUE temporal-basic\n```\n\nAlso I adjusted such matching parameters:\n```\nmatching.numTaskqueueReadPartitions:\n- value: 100\n  constraints: {}\nmatching.numTaskqueueWritePartitions:\n- value: 100\nenter code here\n```\n\nAlso when I am playing with a different configurations of worker from time to time I can get such errors on the history service:\n```\ntemporal-history-5f8757cc4f-v8h94 temporal-history {\"level\":\"error\",\"ts\":\"2021-08-09T22:26:09.181Z\",\"msg\":\"Fail to process task\",\"service\":\"history\",\"shard-id\":255,\"address\":\"10.218.13.7:7234\",\"shard-item\":\"0xc09d263700\",\"component\":\"transfer-queue-processor\",\"cluster-name\":\"active\",\"shard-id\":255,\"queue-task-id\":2213997,\"queue-task-visibility-timestamp\":\"2021-08-09T22:26:00.658Z\",\"xdc-failover-version\":0,\"queue-task-type\":\"TransferActivityTask\",\"wf-namespace-id\":\"4b775794-a076-499e-aa11-177db696d780\",\"wf-id\":\"basic-workflow-30-0-5-3523\",\"wf-run-id\":\"fc82334c-b57d-4d08-8c0d-480b6156b995\",\"error\":\"context deadline exceeded\",\"lifecycle\":\"ProcessingFailed\",\"logging-call-at\":\"taskProcessor.go:332\",\"stacktrace\":\"go.temporal.io/server/common/log.(*zapLogger).Error\\n\\t/temporal/common/log/zap_logger.go:143\\ngo.temporal.io/server/service/history.(*taskProcessor).handleTaskError\\n\\t/temporal/service/history/taskProcessor.go:332\\ngo.temporal.io/server/service/history.(*taskProcessor).processTaskAndAck.func1\\n\\t/temporal/service/history/taskProcessor.go:218\\ngo.temporal.io/server/common/backoff.Retry\\n\\t/temporal/common/backoff/retry.go:103\\ngo.temporal.io/server/service/history.(*taskProcessor).processTaskAndAck\\n\\t/temporal/service/history/taskProcessor.go:244\\ngo.temporal.io/server/service/history.(*taskProcessor).taskWorker\\n\\t/temporal/service/history/taskProcessor.go:167\"}\n```\n\nThe goal’s to understand what I should adjust(options/configs) to get more performance from Temporal.I will appreciate any tips on where to look at a problem.",
        "accepted_answer": null,
        "all_answers": [
            "Here's a guide on how to think about Worker tuning. If it doesn't cover your case, pleasesubmit an issue!https://docs.temporal.io/application-development/worker-performance/"
        ]
    },
    {
        "title": "how to grep a string from file in skill file(.il)",
        "question": "\n```\nsumfile = simplifyFilename(\"getWorkingDir/perc.sum\")\nsumpath = strcat(\"grep -r \"RUN COMPLETED\" \" sumfile \" > out.txt\")\nprint(sumpath)\nsystem(sumpath)\n```\n\nam getting error asErrorlineread/read: syntax error encountered in input",
        "accepted_answer": null,
        "all_answers": [
            "You should escape quote marks. See below\n```\nstrcat(\"grep -r \\\"RUN COMPLETED\\\" \" sumfile \" > out.txt\")\n```\n\n"
        ]
    },
    {
        "title": "How to create workflows dynamically in cadence",
        "question": "Each workflow should be implemented in a separate workflow class?Is it recommended to implement a generic workflow class where we will call activities and fire timers using the argument which passed to the workflow?In our use case, we will be creating workflows from UI and it will be created by the end-user. So we cannot define our workflows initially.Is it recommended approach?",
        "accepted_answer": null,
        "all_answers": [
            "It’s not recommended.Even though it is still possible if you have to create and register workflow class dynamically using anonymous class. But it will be very difficult to maintain and debug. For example, registering a workflow requires a unique workflow type name, and also it’s required to register back the exact same workflow after worker restarts. Etc.What you describe is very common use cases in Cadence. And this is also the power of Cadence over other DSL workflow engine. What you need to do is implement a workflow in a way that takes in dynamic input parameters, and decides the behavior on the input. It’s essentially exactly same as what you want to do with dynamic workflow class."
        ]
    },
    {
        "title": "How does history replay works in cadence?",
        "question": "How does history replay work in cadence?I have a workflow which calls two activity sequentially.Say, the first activity got completed and the second has 100 no of lines of code. If the app server restarts when executing the 50th line of the code in activity2, is it exactly starts the execution from the 50th line. If yes, what magic is happening inside cadence?\n```\n@Override\n    public String composeGreeting(String greeting, String name) throws Exception {\n      FileWriter fw =\n          new FileWriter(\n              \"/Users/kumble-004/Documents/Uber_Cadence/Sample_Projects/TestCadence/src/com/company/\"+name+\".txt\");\n\n      System.out.println(\n          DateTimeFormatter.ofPattern(\"yyyy/MM/dd HH:mm:ss\").format(LocalDateTime.now())\n              + \" [Activity] started\");\n\n      long time = System.currentTimeMillis() + 240000;\n      int i = 0, j=1;\n\n      while (System.currentTimeMillis() != time) {\n        if(i++ %10000000 == 0) {\n          fw.write(\"print - \" + j++ + \" \" +\n                  DateTimeFormatter.ofPattern(\"yyyy/MM/dd HH:mm:ss\").format(LocalDateTime.now()) +\"\\n\");\n        }\n      }\n      fw.close();\n      System.out.println(\n          DateTimeFormatter.ofPattern(\"yyyy/MM/dd HH:mm:ss\").format(LocalDateTime.now())\n              + \" [Activity] ended\");\n\n      return greeting + \" \" + name + \"!\";\n    }\n  }\n```\n\nI have the above code in my hello activity. this code will run for 4 minutes and it will be writing data in a file when a condition meetsI started a workflow and have quit the cadence server after printing[Activity] started. I didn't start it just stops it. But after 4 minutes it is exactly printing[Activity] Endedin the console. I am wondering how is this possible because I stop the server but code is executing, data is writtening in file.While I am checking it via cadence UI it shows that the last history isActivityTaskStarted. And I started my server. After 15 mins(beacuse scheduleToCloseTimeoutSeconds is 15 mins) Activity returns with eventActivityTaskTimedOutand the whole whorkflow has failed due to this timeout.Kindly explain what is happening when restarting cadence server ?",
        "accepted_answer": "If the app server restarts when executing the 50th line of the code in activity2, is it exactly starts the execution from the 50th lineNo, it will not resume from 50th line of activity automatically for you.Replay is only happening for Workflow. It is relaying on History to replay and rebuild the memory stack. Everything happens in the workflow is stored in the history:Every step in the workflow code, generates a bunch of results called \"Decision\"Activity/ChildWorkflow resultsExternal events like SignalsTimersEtc.For more details, please refer tothe doc about replay historyandWhat exactly is a Cadence decision task?But after 4 minutes it is exactly printing [Activity] Ended in the console. I am wondering how is this possible because I stop the server but code is executing, data is writtening in file.That's because your activity worker is still running. The code you are running is purely activity code.However, it activity results will not be able reported to server when the server is down. Which means the history will lose it and workflow may reschedule another activity(if retry is enabled).Please refer tothe doc about activity timeout and retry",
        "all_answers": []
    },
    {
        "title": "How to get result of an Activity without waiting for ? In a event driven fashion",
        "question": "Team, I have a doubt in calling activities in parallel.I know that activities can be called parallelly using theAsync.function.For my use case, I wanted to call n no of activities in parallel after receiving results from all activities I wanted to go to the next state either it could another activity or a decision task.But here it gives me a Promise object which similar to Future in java. If we write promise.get() to get a result but it is blocking the thread.I need something similar to event-driven fashion without blocking the thread.Hope you understand my question!!",
        "accepted_answer": null,
        "all_answers": [
            "You don't have to use.get().InPromise, you can register a callback function to be invoked when the result is available or an error is returned.You can use one of the below depends on what you need:thenApplyhandlethenComposeexceptionallyThis style is similar to Java'sCompletableFuture.\n```\n/**\n   * Returns Promise that contains a result of a function. The function is called with the value of\n   * this Promise when it is ready. #completeExceptionally is propagated directly to the returned\n   * Promise skipping the function.\n   *\n   * <p>Note that no blocking calls are allowed inside of the function.\n   */\n  <U> Promise<U> thenApply(Functions.Func1<? super V, ? extends U> fn);\n\n  /**\n   * Returns Promise that contains a result of a function. The function is called with the value of\n   * this Promise or with an exception when it is completed. If the function throws a {@link\n   * RuntimeException} it fails the resulting promise.\n   *\n   * <p>Note that no blocking calls are allowed inside of the function.\n   */\n  <U> Promise<U> handle(Functions.Func2<? super V, RuntimeException, ? extends U> fn);\n\n  /**\n   * Returns a new Promise that, when this promise completes normally, is executed with this promise\n   * as the argument to the supplied function.\n   *\n   * @param fn the function returning a new Promise\n   * @param <U> the type of the returned CompletionStage's result\n   * @return the Promise that completes when fn returned Promise completes.\n   */\n  <U> Promise<U> thenCompose(Functions.Func1<? super V, ? extends Promise<U>> fn);\n\n  /**\n   * Returns a new Promise that, when this promise completes exceptionally, is executed with this\n   * promise's exception as the argument to the supplied function. Otherwise, if this promise\n   * completes normally, then the returned promise also completes normally with the same value.\n   *\n   * @param fn the function to use to compute the value of the returned CompletionPromise if this\n   *     CompletionPromise completed exceptionally\n   * @return the new Promise\n   */\n  Promise<V> exceptionally(Functions.Func1<Throwable, ? extends V> fn);\n```\n\n",
            "Adding to the great Long's answer.You can usePromise.anyOfto wait on the completion of a single Promise from a collection in a blocking manner."
        ]
    },
    {
        "title": "Which one will suit for complete workflow design Temporal or Cadence",
        "question": "I wanted to design a complete end-to-end workflow orchestration engine.It has the following requirementsLinear workflowParallel workflow- I wanted to execute n no of activities parallelly. After validates the results from all the activities I wanted to\nproceed to the next state or will fail the workflowBatch- say I have 30 activities to be completed but I want this to be done in a batch fashion. Like if the window size is 5 then I wanted\nto execute 5 activities at a time T. After executing all the activities\nand validates the results will proceed further or fail the workflow.Loop- wanted to run an activity infinitely until some condition meetsChild WorkflowPolling",
        "accepted_answer": "All 1-5 are supported easily in Cadence workflow. I am not sure what you mean byPolling. If you can provide more details, I will update this answer to help you.Here is thesample to execute activities in Leaner+parallel/batch+loop:@Override\n  public long calculate(long a, long b, long c) {\n    LOGGER.info(\"workflow start...\");\n\n    long result = 0;\n\n    // Async.invoke takes method reference and activity parameters and returns Promise.\n    Promise<Long> ab = Async.function(activities::multiple, a, b);\n    Promise<Long> ac = Async.function(activities::multiple, a, c);\n    Promise<Long> bc = Async.function(activities::multiple, b, c);\n\n    // Promise#get blocks until result is ready.\n    this.abPlusAcPlusBc = result = ab.get() + ac.get() + bc.get();\n\n    // waiting 30s for a human input to decide the factor N for g(n), based on a*b+a*c+b*c\n    // the waiting timer is durable, independent of workers' liveness\n    final boolean received = Workflow.await(Duration.ofMinutes(2), () -> this.factorForGn > 1);\n    if (!received) {\n      this.factorForGn = 10;\n    }\n\n    long fi_1 = 0; // f(0)\n    long fi_2 = 1; // f(1)\n    this.currentG = 1; // current g = f(0)*f(0) + f(1)*f(1)\n    long i = 2;\n\n    for (; i < this.factorForGn; i++) {\n      // get next fibonacci number\n      long fi = fi_1 + fi_2;\n      fi_2 = fi_1;\n      fi_1 = fi;\n\n      this.currentG += activities.multiple(fi, fi);\n    }\n\n    result += this.currentG;\n    return result;\n  }And this is thesample of using ChildWorkflow.",
        "all_answers": []
    },
    {
        "title": "How to understand which SystemVerilog is supported by Cadence XMVLOG compiler?",
        "question": "I need to move my SV simulation environment from Questa to Xcelium 20.9.\nI'm facing problems compiling my files withxmvlog, while there are no issues withvlog.So here's what I did.Make sure the toolchain is correctly installed: I ran this simple example fromedaplayground. It works fine.  I am also able to see the waves in SimvisionTry out a more complex design, which includes some classes and packages.Here's where I'm not able to proceed: I fail to compile a package. I tried to simplify the file and extract a minimal non-working example.The file looks like this:\n```\npackage test_pkg;\n  task wait (ref logic clock, int cycl_num);\n    for (int k = 0; k < cycl_num; k++) begin\n      @(posedge clock);\n    end\n  endtask : wait\nendpackage\n```\n\nSo, simple package with one task.\nRunningxrun test/test_pkg.sv:Lots of errors here. One thing I noticed is that addingvoidat the beginning of the task declaration solves a few of them.With that done, the output is:The problem is in the task definition, as I am able to compile if it is removed.I also tried the following options for xmvlog-sv                        Force SystemVerilog compilation-sysv2005                  Only enable SV-2005 and earlier keywords-sysv2009                  Only enable SV-2009 and earlier keywordsBut no luck.\nAny idea what is wrong here? How do I specify the right SystemVerilog version?",
        "accepted_answer": "The problem is with your code, not with the Cadence simulator.One problem is thatwaitis a Verilog keyword, and it should not be used as ataskname.  Refer to IEEE Std 1800-2017, section 9.4Procedural timing controls; it is also part of the 1364 Std.  Questa should have given you an error.You need to change the name to something else, likewait_clk.  You need to change it after theendtaskkeyword as well.Another problem is that Cadence also gives me errors usingref.task wait_clk (ref logic clock, int cycl_num);\n                               |\nxmvlog: *E,REFANA : reference argument is illegal inside static task-function declaration.\n  task wait_clk (ref logic clock, int cycl_num);\n                                             |\nxmvlog: *E,REFANA : reference argument is illegal inside static task-function declaration.I don't think you need these inputs to be references.  If that is the case, then you can simply remove it:package test_pkg;\n  task wait_clk (logic clock, int cycl_num);\n    for (int k = 0; k < cycl_num; k++) begin\n      @(posedge clock);\n    end\n  endtask : wait_clk\nendpackageHowever, if you do want aref, you can get more details usingnchelp:nchelp xmvlog REFANA\nxmhelp: 20.09-s009: (c) Copyright 1995-2021 Cadence Design Systems, Inc.\nxmvlog/REFANA =\n    A SystemVerilog reference argument, declared in the formal argument list\n    of a task or function, must always be an automatic variable.  The enclosing\n    task or function declaration must therefore use the 'automatic' keyword\n    to promote all of its formal arguments into automatic variables.If you just wantclockto be aref:package test_pkg;\n  task automatic wait_clk (ref logic clock, input int cycl_num);\n    for (int k = 0; k < cycl_num; k++) begin\n      @(posedge clock);\n    end\n  endtask : wait_clk\nendpackageYou should not usevoidfor atask.  Doing so did not really fix anything; it just took the compiler down a different path.",
        "all_answers": []
    },
    {
        "title": "Cadence: What is the best practice to change the workflow cron schedule?",
        "question": "We have a workflow that uses cron based scheduling. We need to support a use case to change the cron expression.What is the best practice to do so?",
        "accepted_answer": "TL;DRStart the same cron workflow again with the same workflowID, with IDReusePolicy =TerminteIfRunningExampleLike in the documentation, CRON will stop only when canceled or terminate. So you can also terminate/cancel, and then start a new one. But there is no consistency guarantee if you use two requests to do it yourself.Using IDReusePolicy =TerminteIfRunningwill make sure terminate+start is an atomic operation in Cadence.Here is the example of using it1.Start ahelloworldworker./bin/helloworld -m worker &\n[1] 24808\n2021-03-22T20:08:09.404-0700    INFO    common/sample_helper.go:97  Logger created.\n2021-03-22T20:08:09.405-0700    DEBUG   common/factory.go:131   Creating RPC dispatcher outbound    {\"ServiceName\": \"cadence-frontend\", \"HostPort\": \"127.0.0.1:7933\"}\n...\n...Starting a cron workflow$./cadence  --do samples-domain wf start --tl helloWorldGroup -w \"test-cron\" --execution_timeout 10 --cron \"* * * * *\" --wt \"main.helloWorldWorkflow\" -i '\"Hello\"'\nStarted Workflow Id: test-cron, run Id: 2d9f06f9-7e79-4c9d-942a-e2c6a20c9f85Update the cron workflow$./cadence  --do samples-domain wf start --tl helloWorldGroup -w \"test-cron\" --execution_timeout 10 --cron \"* * * * *\" --wt \"main.helloWorldWorkflow\"  -i '\"Cadence\"'  --workflowidreusepolicy 3 \nStarted Workflow Id: test-cron, run Id: 4344448d-5a95-4a91-a56e-ebc0b93b4d29NOTE that in CLI:--workflowidreusepolicy 3will set the IDReusePolicy =TerminteIfRunningThe CLI usage will be updated after thisPR.Then you should be able to see the helloworld workflow print the new value:$2021-03-22T20:24:00.307-0700   INFO    helloworld/helloworld_workflow.go:29    helloworld workflow started {\"Domain\": \"samples-domain\", \"TaskList\": \"helloWorldGroup\", \"WorkerID\": \"24808@IT-USA-25920@helloWorldGroup\", \"WorkflowType\": \"main.helloWorldWorkflow\", \"WorkflowID\": \"test-cron\", \"RunID\": \"1e2e6d2f-dcc7-410f-8d06-81c94622bbb7\"}\n2021-03-22T20:24:00.307-0700    DEBUG   internal/internal_event_handlers.go:470 ExecuteActivity {\"Domain\": \"samples-domain\", \"TaskList\": \"helloWorldGroup\", \"WorkerID\": \"24808@IT-USA-25920@helloWorldGroup\", \"WorkflowType\": \"main.helloWorldWorkflow\", \"WorkflowID\": \"test-cron\", \"RunID\": \"1e2e6d2f-dcc7-410f-8d06-81c94622bbb7\", \"ActivityID\": \"0\", \"ActivityType\": \"main.helloWorldActivity\"}\n...",
        "all_answers": []
    },
    {
        "title": "Cacence CLI unable to register a new domain: BadRequestError{Message: Invalid cluster name: }",
        "question": "I am trying to register a new domain following the docs forcadence.When I try domain describe command, it works as expected:\n```\ndocker run --rm ubercadence/cli:master --address host.docker.internal:7933 --domain samples-domain domain describe\n\nError: Domain samples-domain does not exist.\nError Details: EntityNotExistsError{Message: Domain samples-domain does not exist.}\n('export CADENCE_CLI_SHOW_STACKS=1' to see stack traces)\n```\n\nWhen I run domain register command, it gives this error\n```\ndocker run --rm ubercadence/cli:master --address host.docker.internal:7933 --domain samples-domain domain register\n\nError: Register Domain operation failed.\nError Details: BadRequestError{Message: Invalid cluster name: }\n('export CADENCE_CLI_SHOW_STACKS=1' to see stack traces)\n```\n\nI also tried the same command with--gd falseoption, still the same result.Here is the stack trace output:\n```\nStack trace:\ngoroutine 1 [running]:\nruntime/debug.Stack(0xd, 0x0, 0x0)\n    /usr/local/go/src/runtime/debug/stack.go:24 +0x9d\nruntime/debug.PrintStack()\n    /usr/local/go/src/runtime/debug/stack.go:16 +0x22\ngithub.com/uber/cadence/tools/cli.printError(0x206594b, 0x21, 0x2559ce0, 0xc000496020)\n    /cadence/tools/cli/util.go:536 +0x2ad\ngithub.com/uber/cadence/tools/cli.ErrorAndExit(0x206594b, 0x21, 0x2559ce0, 0xc000496020)\n    /cadence/tools/cli/util.go:547 +0x49\ngithub.com/uber/cadence/tools/cli.(*domainCLIImpl).RegisterDomain(0xc000415600, 0xc0000dcf20)\n    /cadence/tools/cli/domainCommands.go:150 +0x8cd\ngithub.com/uber/cadence/tools/cli.newDomainCommands.func1(0xc0000dcf20)\n    /cadence/tools/cli/domain.go:73 +0x48\ngithub.com/urfave/cli.HandleAction(0x1c20dc0, 0x20ed500, 0xc0000dcf20, 0xc0000dcf20, 0x0)\n    /go/pkg/mod/github.com/urfave/[email protected]/app.go:528 +0x127\ngithub.com/urfave/cli.Command.Run(0x2030e21, 0x8, 0x0, 0x0, 0xc0002da9a0, 0x1, 0x1, 0x204f0c0, 0x18, 0x0, ...)\n    /go/pkg/mod/github.com/urfave/[email protected]/command.go:174 +0x528\ngithub.com/urfave/cli.(*App).RunAsSubcommand(0xc00034b340, 0xc0000dcc60, 0x0, 0x0)\n    /go/pkg/mod/github.com/urfave/[email protected]/app.go:407 +0x882\ngithub.com/urfave/cli.Command.startApp(0x202d311, 0x6, 0x0, 0x0, 0xc0002dae90, 0x1, 0x1, 0x204a264, 0x16, 0x0, ...)\n    /go/pkg/mod/github.com/urfave/[email protected]/command.go:373 +0x845\ngithub.com/urfave/cli.Command.Run(0x202d311, 0x6, 0x0, 0x0, 0xc0002dae90, 0x1, 0x1, 0x204a264, 0x16, 0x0, ...)\n    /go/pkg/mod/github.com/urfave/[email protected]/command.go:102 +0x9d6\ngithub.com/urfave/cli.(*App).Run(0xc00034b180, 0xc00003a070, 0x7, 0x7, 0x0, 0x0)\n    /go/pkg/mod/github.com/urfave/[email protected]/app.go:279 +0x731\nmain.main()\n    /cadence/cmd/tools/cli/main.go:36 +0x4f\n```\n\nI am not sure what's exactly wrong.",
        "accepted_answer": "The below command worked for me:docker run --rm ubercadence/cli:master --address host.docker.internal:7933 --domain samples-domain domain register --active_cluster activeLooks like there is a bug, hopefully it will be resolved in the future release.https://github.com/uber/cadence/issues/4054",
        "all_answers": []
    },
    {
        "title": "Cadence Genus print multiline string",
        "question": "I'm new to Genus, first time working with it.\nTo synthesisze my design I run a rather long .tcl script, which produces a way longer .log file.To make it easier for me to navigate the log, I would like to print a banner in certain specific points.\nHere's my try:\n```\nputs \" ██████  ███████ ████████ ██    ██ ██████  ███    ██ \\n\"\nputs \" ██   ██ ██         ██    ██    ██ ██   ██ ████   ██ \\n\"\nputs \" ██████  █████      ██    ██    ██ ██████  ██ ██  ██ \\n\"\nputs \" ██   ██ ██         ██    ██    ██ ██   ██ ██  ██ ██ \\n\"\nputs \" ██   ██ ███████    ██     ██████  ██   ██ ██   ████ \\n\"\n```\n\nBut what I get is far from the expected:\n```\n@file(run_genus.tcl) 94: puts \" ██████  ███████ ████████ ██    ██ ██████  ███    ██ \\n\" \n ██████  ███████ ████████ ██    ██ ██████  ███    ██ \n\n@file(run_genus.tcl) 95: puts \" ██   ██ ██         ██    ██    ██ ██   ██ ████   ██ \\n\" \n ██   ██ ██         ██    ██    ██ ██   ██ ████   ██ \n\n@file(run_genus.tcl) 96: puts \" ██████  █████      ██    ██    ██ ██████  ██ ██  ██ \\n\" \n ██████  █████      ██    ██    ██ ██████  ██ ██  ██ \n\n@file(run_genus.tcl) 97: puts \" ██   ██ ██         ██    ██    ██ ██   ██ ██  ██ ██ \\n\" \n ██   ██ ██         ██    ██    ██ ██   ██ ██  ██ ██ \n\n@file(run_genus.tcl) 98: puts \" ██   ██ ███████    ██     ██████  ██   ██ ██   ████ \\n\" \n ██   ██ ███████    ██     ██████  ██   ██ ██   ████\n```\n\nGenus prints out each command and then executes it. This is useful, it allows for example to search for a specific command in the log file, but breaks multiline prints as the one I'm attempting.Does anyone know what is the proper way of doing what I'm trying to do here?",
        "accepted_answer": "You can do multiline strings in Tcl easily, provided you've enclosed the string in double quotes or braces.puts \"\\\n ██████  ███████ ████████ ██    ██ ██████  ███    ██ \n ██   ██ ██         ██    ██    ██ ██   ██ ████   ██ \n ██████  █████      ██    ██    ██ ██████  ██ ██  ██ \n ██   ██ ██         ██    ██    ██ ██   ██ ██  ██ ██ \n ██   ██ ███████    ██     ██████  ██   ██ ██   ████ \\n\"I've been a bit tricky with the backslash on the first line so that the word also shows up in readable form in the source.",
        "all_answers": []
    },
    {
        "title": "Cadence workflow not executing activities after introducing versioning",
        "question": "I introduced cadence versioning in to cadence workflow and after that the workflow has stopped exeucting at the point of versioning introduction.\nI am receiving the following error :2020-10-29T07:23:49.587Z DEBUG   internal/internal_event_handlers.go:465 ExecuteActivity {\"Domain\":\n\"domain_1\", \"TaskList\": \"tasklist_1\", \"WorkerID\":\n\"6@cdnc-5ddb9ccbb5-5dt5j@tasklist\", \"WorkflowType\":\n\"do_work_workflow\", \"WorkflowID\": \"CREATE\", \"RunID\":\n\"cab97b65-9892-48c5-b842-3f8b462d8602\", \"ActivityID\": \"4\",\n\"ActivityType\": \"do_Task_D\"}\n2020-10-29T07:23:49.620Z  DEBUG   internal/internal_task_handlers.go:1077 Cached state staled, new task has unexpected events {\"Domain\": \"domain_1\",\n\"TaskList\": \"tasklist_1\", \"WorkerID\":\n\"6@cdnc-5ddb9ccbb5-5dt5j@tasklist1\", \"WorkflowID\": \"CREATE\", \"RunID\":\n\"cab97b65-9892-48c5-b842-3f8b462d8602\",\n\"CachedPreviousStartedEventID\": 30, \"TaskFirstEventID\": 22,\n\"TaskStartedEventID\": 30, \"TaskPreviousStartedEventID\": 21}My workflow code will look like this:\n```\nfunc doWorkflow(ctx workflow.Context, input string) error {\n    err := doTaskA(input)\n    if err != nil {\n        return err\n    }\n    err = doTaskB(input)\n    if err != nil {\n        return err\n    }\n    versionTaskC := workflow.GetVersion(ctx, \"ChangeID\", workflow.DefaultVersion, 1)\n    if versionTaskC == workflow.DefaultVersion {\n        err = doTaskC(input)\n        if err != nil {\n            return err\n        }\n    } else {\n        err = doTaskD(input)\n        if err != nil {\n            return err\n        }\n    }\n    err = doTaskD2(input)\n    if err != nil {\n        return err\n    }\n    err = doTaskD3(input)\n    if err != nil {\n        return err\n    }\n    return nil\n}\n```\n\nAt the ChangeID , version returned is 1, and the workflow tries to execute TaskD but, it is not executing it, It is stuck in an infinite loop, trying to execute the TaskD.The error message I get isCached state staled, new task has unexpected eventsandBadRequestError{Message: CadenceChangeVersion is not valid search\nattribute}Can you please help me with this issue ?",
        "accepted_answer": "there are two possibles:You are running a Cadence server with version lower than 0.11.[very likely]Your Cadence server upgraded from a lower version but didn't make the elasticSearch schema change:cadence admin cluster add-search-attr --search_attr_key CadenceChangeVersion --search_attr_type 1And you probably also need to add this:cadence admin cluster add-search-attr --search_attr_key BinaryChecksums --search_attr_type 1Background:CadenceChangeVersion is introduced inhttps://github.com/uber/cadence/releases/tag/v0.11.0It's to help searching for workflow change versions.Let me know if this is not correct.",
        "all_answers": []
    },
    {
        "title": "Connect Cadence to Azure Cosmo Cassandra API",
        "question": "I am running cadence with cassandra externally running using docker run -e CASSANDRA_SEEDS=10.x.x.x e ubercadence/server:. and its running sucessfully.Azure cosmos says, any system running on Cassandra can use Azure cosmos using provided cosmos cassandra APi, by modifying the client connection creation code, for example : GO app sample code :\n```\nfunc GetSession(cosmosCassandraContactPoint, cosmosCassandraPort, cosmosCassandraUser, cosmosCassandraPassword string) *gocql.Session {\n    clusterConfig := gocql.NewCluster(cosmosCassandraContactPoint)\n    port, err := strconv.Atoi(cosmosCassandraPort)\n    \n    clusterConfig.Authenticator = gocql.PasswordAuthenticator{Username: cosmosCassandraUser, Password: cosmosCassandraPassword}\n    clusterConfig.Port = port\n    clusterConfig.SslOpts = &gocql.SslOptions{Config: &tls.Config{MinVersion: tls.VersionTLS12}}\n    clusterConfig.ProtoVersion = 4\n    \n    session, err := clusterConfig.CreateSession()\n    ...\n    return session\n}\n```\n\nFrom my end, I can connect external cassandra's cqlsh(which cadence is using for persisting)  to azure cosmos and can create KeySpace, table in azure cosmo db.\nHowever, when I run Cadence server, all new tables are still created on local cassandra itself(instead of Axure cosmos) might be, cadence is connected to cassandra only.So there are basically 2 question shared below  :1.Since cadence is written in GO, can we modify the source code to establish connection to AzureCosmoDb.\noror can we pass the cosmocassandra's host, port, username, password, while running the cassandra and cadence separately (docker run -e CASSANDRA_SEEDS=10.x.x.x e ubercadence/server:)cosmosCassandraContactPoint : xyz.cassandra.cosmos.azure.com\ncosmosCassandraPort : 10350\ncosmosCassandraUser : xyz\ncosmosCassandraPassword : xyz",
        "accepted_answer": null,
        "all_answers": [
            "I am actively working on supporting other NoSQL DBs:https://github.com/uber/cadence/issues/3514it will be easier to use Azure cosmos/AWS Keyspace after that's done.Basically we will just need to customize a small part from the existing Cassandra model."
        ]
    },
    {
        "title": "Does cadence support Azure Cosmos DB Cassandra API instead of cassandra",
        "question": "Does Cadence support  Azure Cosmos DB Cassandra API instead of Apache cassandra, to persist the Data.\nIf yes, can you share the sample docker-compose configuration.",
        "accepted_answer": null,
        "all_answers": [
            "Last time we checked (2019) the Cosmos DB didn't support Cassandra APIs (or their semantic) needed for Cadence/Temporal to work. We were also advised to use Cosmos APIs directly instead. Unfortunately, we didn't have the resources to implement the Cosmos binding yet.But you are free to try. I would recommend starting from ahelm chartthat supports specifying Cassandra as an external dependency."
        ]
    },
    {
        "title": "Do System Verilog coverpoints and covergroups work for real variable types?",
        "question": "I'm looking into using coverpoints and covergroups for mixed signal verification in Cadence to verify some constrained random classes I've written.  However, I haven't been able to find online if coverpoints can be used for reals.  In fact, I've found some older articles saying they're not supported.  Can coverpoints be used to verify reals and if so what additional syntax in necessary?",
        "accepted_answer": "No. TheSystemVerilog LRMsection 19.5 saysA coverage point specifies an integral expression that is to be\ncovered.Thebinstructure ofcoverpointis defined using equality operations, which real numbers has problems with approximation.",
        "all_answers": []
    },
    {
        "title": "gm/Id design characteristics",
        "question": "What are the limitations of the gm/id based analog design methodology employed for sub-micron process nodes? I was reading a research paper that mentioned the design methodology is restricted only to class A devices.",
        "accepted_answer": "gm/id methodology can be used for any design where transistors are in the saturation region",
        "all_answers": []
    },
    {
        "title": "Cadence Virtuoso Layout XL",
        "question": "I am new to Cadence Virtuoso Layout.Is there any book or complete educational videos for Cadence Virtuoso Layout design? I have some DRC errors on my design and need to know how to solve the errors in different metal layers.",
        "accepted_answer": null,
        "all_answers": [
            "DRC error belongs to Physical Verification, which has many tools support like Assura, Mentor Calibre... To fix the DRC error, you have to read the PDK (Process Design Kit) document.About the education video for Cadence Virtuoso Layout Design, there is some video on Youtube as far as I know. However, the best way to learn is doing real layout design work. If you have any problem, find the manual of tool in Cadence Help."
        ]
    },
    {
        "title": "How to Identify values from characteristic data for Walk Run Stride bluetooth sensor",
        "question": "I am developing a workout app with sensor connectivity and able to read and get data for Heart rate sensor but for stride sensors (walk/Run) facing problem to map the values given by sensor characteristic.How will I get Speed, cadence, steps per mints , Distance.?\nI searched on google didn't get for this.I am pretty much sure getting data but difficulty in mapping index and values for different parameters.Check attached code snapshot for data output.Thanks in Advance...!!",
        "accepted_answer": null,
        "all_answers": [
            "This question should not be taggedcadence, unless I'm missing something? That tag if for \"A global provider of Electronic Design Automation (EDA) software and engineering services.\"PS: I can't comment yet, please resolve this and delete this answer."
        ]
    },
    {
        "title": "Function optional parameters not in sensitivity list when called from assign",
        "question": "I think I've figured out why this happens, but I would like to confirm it, and to see if there is a better solution.Consider the following module which has a function where the default for one of the parameters is bound to some register inside the module:\n```\nmodule m;\n  reg a, b;\n  wire out;\n  function f1 (input x, input y = b);\n    f1 = x & y;\n  endfunction :f1\n\n  // ...\n  assign out = f1(a);\nendmodule\n```\n\nThe issue that I'm seeing (which wasn't easy to track down) is that in this case, the sensitivity list of the assignment only has a. So if b changes, and then a changes, out will be properly updated. However, if a changes, and then b changes, because b isn't in the sensitivity list for the assignment of out, out will not be updated and will still be set to the old value.Is there a preferred way to add b to the sensitivity list so out will be updated when it changes?I see a few possible options:Just explicitly add the second argument:f1(a, b)Use a continuous assignment blockalways_comb out = f1(a)oralways @(*) out=f1(a)Use an explicit sensitivity listalways @(a, b) out = f1(a)Personally I think option 1 is the best (even though it would replicate the optional parameters every location it is called), but I'm curious if there are other explanations, or if there is a better solution.",
        "accepted_answer": "Option 1 defeats the default argument feature. You would have to make sure nobody supplies a default in the declaration so you don't run into this problem again.Option 3 is a not an option anymore as you discovered—it is a nightmare to debug.Thealways_combconstruct was specifically designed for this kind of coding style. In fact, people wanted to write functions with no inputs or outputs simply as a code structuring mechanism making the code easier to manage.always_comb begin\n          phase_one_stuff;\n          phase_two_stuff;\n          if (mode==A)\n               mode_A_stuff;\n          else\n               mode_B_stuff;\n          phase_three_stuff;\n       endDo not use@(*)in SystemVerilog.always_combreplaces it and has the benefit of dealing with time 0 initial values that@(*)may not be sensitive to.",
        "all_answers": []
    },
    {
        "title": "Cadence IUS simulator options",
        "question": "What is the difference between -INcdir and +incdir+ options in NC simulator?Below is the example command from the Makefile. As far as I know the testbench directories are included using-INcdirand  the source code file directories are included using+incdir+command\n```\nncvlog -SV -INcdir ../include -INcdir ../src -64bit ../src/top.sv ../src/test.sv;\nncelab ncelab.log top +incdir+../../../sv/src +incdir+../../../sv/include\n```\n\nPlease help me to understand the the significance of these options.",
        "accepted_answer": "I agree with Tudor. They actually mean the same thing.The +incdir+argis replaced with ncvlog -incdirarg, the same way in which +define+argis replaced with ncvlog -definearg.It is referred to as \"Plus\" option translation in the Cadence NC-Verilog Simulator user guide.",
        "all_answers": []
    },
    {
        "title": "How to pass a string variable (not a string literal) to $dumpfile system task?",
        "question": "I am running simulations with different parameters passed to the testbench as plusargs. I want to dump a separate VCD file for each of these runs. I tried declaring a string variable and constructing the file name using the parameters passed, and pass this on to$dumpfile.\n```\nstring file_name;\n    file_name = \"tx_dsp.vcd\"\n    $dumpfile(file_name);\n```\n\nBut, I am getting the following error in IES:Passing string variable to this system task/function is currently not supportedAs a workaround, I defined the file name from the command line and used it as argument to$dumpfile. This works, but not if the test parameters were randomized from inside the testbench.Is this the behaviour of simulator or SystemVerilog?",
        "accepted_answer": "According tothe SystemVerilog LRM, it should be possible. In 21.7.1.1, it says the following:dumpfile_task ::=\n$dumpfile ( filename ) ;The filename is an expression that isa string literal, string data\n  type, or an integral data type containing a character string that\n  names the file to be opened. The filename is optional and defaults to\n  the string literal \"dump.vcd\" if not specified.You are using astring data typein your example (Section 6.16 in the aforementioned document). An advantage is that the length of the string is dynamic and that no truncation can occur.String literals (Section 5.9 in the LRM), on the other hand, behave like packed arrays. If your compiler does not support string data types in$dumpvars, you can try to definefile_nameas a string literal:reg[N*8:0] file_name;\nfile_name = \"tx_dsp.vcd\"\n$dumpfile(file_name);Here,Nis the maximum number of characters in your string.Please also take a look at Section 11.10 in the LRM. This section describes operations on string literals.",
        "all_answers": []
    },
    {
        "title": "Did anyone used Cadence emanager desktop version and moved to Xcelium simulator which doesn't include its license?",
        "question": "My team relied on emanager desktop version for regression running, coverage merge and reports until now. When we used incisive simulator, the license included basic usage of emanager (desktop version) that helped us with these features. But now when we moved to Xcelium, emanager is no longer supported, and only vmanager exists. However, this requires a different license, something my boss is not so eager to pay for. I was wondering if anyone here experienced the same problem and how did you deal with it?We already evaluated the vManager and it suits our needs perfectly, also the move from emanager to vManager was seamless. Right now we're considering writing our own scripts for running regressions and generating reports, but this seems a monumental task.",
        "accepted_answer": null,
        "all_answers": [
            "I don't have a full answer for you but I think I can shed (a little) light on the license situation:(Cadence feature numbers in brackets.)If you were using emanager under Incisive that implies that you had licenses for Incisive Enterprise Simulator - XL (29651) and the IES-XL Advanced Option (29851). When you moved to Xcelium did you move to Xcelium Single Core (X300) or Xcelium Limited Single Core (X100)?X300 licenses are supposed to contain all the features of 29851 and hence have emanager available as part of the simulator license.We are just starting the switch over from Incisive and this is what I have been told by Cadence."
        ]
    },
    {
        "title": "Combining coverpoints to create an aggregate",
        "question": "\n```\n`define A 'd1\n`define B 'd2\n`define C 'd3\n`define D 'd4\n`define E 'd5\n`define F 'd6\n`define I 'd7\n`define J 'd8\n\nmodule testModule(input clk,\n                        input CReset,\n                        input[4;0] Opcode_P0I1,\n                        input[4;0] Opcode_P0I2,\n                        input[4;0] Opcode_P0I3,\n                        input[4;0] Opcode_P0I4,\n                        input[4;0] Opcode_P1I1,\n                        input[4;0] Opcode_P1I2,\n                        input[4;0] Opcode_P1I3,\n                        input[4;0] Opcode_P1I4,\n                        input P0V,\n                        input P1V,\n                        input P0IsFe,\n                        input P1IsFe,\n                        input P0I1PAllow,\n                        input P0I2PAllow,\n                        input P0I3PAllow,\n                        input P0I4PAllow,\n                        input P1I1PAllow,\n                        input P1I2PAllow,\n                        input P1I3PAllow,\n                        input P1I4PAllow,\n                        input I1VT0,\n                        input I1VT1,\n                        input I1VT2,\n                        input I1VT4,\n                        input I2VT0,\n                        input I2VT1,\n                        input I2VT2,\n                        input I2VT3,\n                        input I3VT0,\n                        input I3VT1,\n                        input I3VT2,\n                        input I3VT3,\n                        input I4VT0,\n                        input I4VT1,\n                        input I4VT2,\n                        input I4VT3,\n                        input[3:0] P0TId,\n                        input[3:0] P1TId);\ncovergroup cg_Abc @(posedge clk);\n    option.per_instance = 1;\n    cp_P0I1_IsSquare: coverpoint Opcode_P0I1 iff (P0V == 1 && P0IsFe == 1 && P0I1PAllow == 1 && (I1VT0 && P0TId == 2**0  || I1VT1 && P0TdId == 2**1 || I1VT2 && P0TId == 2**2 || I1VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n    cp_P0I2_IsSquare: coverpoint Opcode_P0I2 iff (P0V == 1 && P0IsFe == 1 && P0I2PAllow == 1 && (I2VT0 && P0TId == 2**0  || I2VT1 && P0TdId == 2**1 || I2VT2 && P0TId == 2**2 || I2VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n    cp_P0I3_IsSquare: coverpoint Opcode_P0I3 iff (P0V == 1 && P0IsFe == 1 && P0I3PAllow == 1 && (I3VT0 && P0TId == 2**0  || I3VT1 && P0TdId == 2**1 || I3VT2 && P0TId == 2**2 || I3VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n    cp_P0I4_IsSquare: coverpoint Opcode_P0I4 iff (P0V == 1 && P0IsFe == 1 && P0I4PAllow == 1 && (I4VT0 && P0TId == 2**0  || I4VT1 && P0TdId == 2**1 || I4VT2 && P0TId == 2**2 || I4VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n    cp_P1I1_IsSquare: coverpoint Opcode_P1I1 iff (P1V == 1 && P1IsFe == 1 && P1I1PAllow == 1 && (I1VT0 && P1TId == 2**0  || I1VT1 && P1TdId == 2**1 || I1VT2 && P1TId == 2**2 || I1VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n    cp_P1I2_IsSquare: coverpoint Opcode_P1I2 iff (P1V == 1 && P1IsFe == 1 && P1I2PAllow == 1 && (I2VT0 && P1TId == 2**0  || I2VT1 && P1TdId == 2**1 || I2VT2 && P1TId == 2**2 || I2VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n    cp_P1I3_IsSquare: coverpoint Opcode_P1I3 iff (P1V == 1 && P1IsFe == 1 && P1I3PAllow == 1 && (I3VT0 && P1TId == 2**0  || I3VT1 && P1TdId == 2**1 || I3VT2 && P1TId == 2**2 || I3VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n    cp_P1I4_IsSquare: coverpoint Opcode_P1I4 iff (P1V == 1 && P1IsFe == 1 && P1I4PAllow == 1 && (I4VT0 && P1TId == 2**0  || I4VT1 && P1TdId == 2**1 || I4VT2 && P1TId == 2**2 || I4VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins derp = {`A,`B,`C};}\n\n    cp_P0I1_IsCircle: coverpoint Opcode_P0I1 iff (P0V == 1 && P0I1PAllow == 0 && (I1VT0 && P0TId == 2**0  || I1VT1 && P0TdId == 2**1 || I1VT2_DE2 && P0TId == 2**2 || I1VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n    cp_P0I2_IsCircle: coverpoint Opcode_P0I2 iff (P0V == 1 && P0I2PAllow == 0 && (I2VT0 && P0TId == 2**0  || I2VT1 && P0TdId == 2**1 || I2VT2_DE2 && P0TId == 2**2 || I2VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n    cp_P0I3_IsCircle: coverpoint Opcode_P0I3 iff (P0V == 1 && P0I3PAllow == 0 && (I3VT0 && P0TId == 2**0  || I3VT1 && P0TdId == 2**1 || I3VT2_DE2 && P0TId == 2**2 || I3VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n    cp_P0I4_IsCircle: coverpoint Opcode_P0I4 iff (P0V == 1 && P0I4PAllow == 0 && (I4VT0 && P0TId == 2**0  || I4VT1 && P0TdId == 2**1 || I4VT2_DE2 && P0TId == 2**2 || I4VT3 &&  P0TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n    cp_P1I1_IsCircle: coverpoint Opcode_P1I1 iff (P1V == 1 && P1I1PAllow == 0 && (I1VT0 && P1TId == 2**0  || I1VT1 && P1TdId == 2**1 || I1VT2 && P1TId == 2**2 || I1VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n    cp_P1I2_IsCircle: coverpoint Opcode_P1I2 iff (P1V == 1 && P1I2PAllow == 0 && (I2VT0 && P1TId == 2**0  || I2VT1 && P1TdId == 2**1 || I2VT2 && P1TId == 2**2 || I2VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n    cp_P1I3_IsCircle: coverpoint Opcode_P1I3 iff (P1V == 1 && P1I3PAllow == 0 && (I3VT0 && P1TId == 2**0  || I3VT1 && P1TdId == 2**1 || I3VT2 && P1TId == 2**2 || I3VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n    cp_P1I4_IsCircle: coverpoint Opcode_P1I4 iff (P1V == 1 && P1I4PAllow == 0 && (I4VT0 && P1TId == 2**0  || I4VT1 && P1TdId == 2**1 || I4VT2 && P1TId == 2**2 || I4VT3 &&  P1TId == 2**3)) {option.weight = 0;type_option.weight = 0; bins bxx = {`D,`E,`F,`G,`H,`I,`J};}\n\n    cr_P0I1I2_IsSqauarexIsCircle : cross cp_P0I1_IsSquare,cp_P0I2_IsCircle{option.weight = 0;type_option.weight = 0;}\n    cr_P0I2I3_IsSqauarexIsCircle : cross cp_P0I2_IsSquare,cp_P0I3_IsCircle{option.weight = 0;type_option.weight = 0;}\n    cr_P0I3I4_IsSqauarexIsCircle : cross cp_P0I3_IsSquare,cp_P0I4_IsCircle{option.weight = 0;type_option.weight = 0;}\n    AggregateCov1 : ?\n\n    cr_P1I1I2_IsSqauarexIsCircle : cross cp_P1I1_IsSquare,cp_P1I2_IsCircle{option.weight = 0;type_option.weight = 0;}\n    cr_P1I2I3_IsSqauarexIsCircle : cross cp_P1I2_IsSquare,cp_P1I3_IsCircle{option.weight = 0;type_option.weight = 0;}\n    cr_P1I3I4_IsSqauarexIsCircle : cross cp_P1I3_IsSquare,cp_P1I14_IsCircle{option.weight = 0;type_option.weight = 0;}\n    AggregateCov2 : ?\n  endgroup\n  cg_Abc cg_Abc_inst = new();\nendmodule\n```\n\nI am looking for AggregateCov1 which tells if any of cr_P0I1I2_IsSqauarexIsCircle,cr_P0I2I3_IsSqauarexIsCircle,cr_P0I3I4_IsSqauarexIsCircle is a hit. Essentially meaning I have at least one square and a circle adjacent to each other in the group [Opcode_P0I1,Opcode_P0I2,Opcode_P0I3,Opcode_P0I4].Also looking for AggregateCov2 which tells if I have at least one square and a circle adjacent to each other in the group [Opcode_P0I1,Opcode_P0I2,Opcode_P0I3,Opcode_P0I4] or [Opcode_P1I1,Opcode_P1I2,Opcode_P1I3,Opcode_P1I4]",
        "accepted_answer": null,
        "all_answers": [
            "There is no need to do this as you need to hit theANDof all coverpointsa,b,cto get 100% coverage of this covergroup.But if you insist, you can use a coverpoint expression\n```\nAggregateCoverpoint: coverpoint v_a | v_b | v_c;\n```\n\n",
            "Using assign statements to create new wires, makes this problem go away."
        ]
    },
    {
        "title": "How to compare each bits of a 32 bits number with another 32 bits number?",
        "question": "I am thinking compare each bits of a 32 bits number with another 32 bits number.\n```\neg.    check that ins.dout_1 == (ins.din1_1 + ins.din2_1)\n```\n\nWhich dout_1, din1_1 and din2_1 are all unsigned integer of 32 bits.\nI want to check for each bits from 12 bit to 7 bit of dout_1 equals to each bits from 12 bit to 7 bit of the result of (ins.din1_1 + ins.din2_1) or not.How can i do this?",
        "accepted_answer": null,
        "all_answers": [
            "You can probably use the bit-slice operation. For example, to compare bits 12 to 7 of somexwith bits 12 to 7 of somey:\n```\ncheck that x[12:7] == y[12:7]\n```\n\nOr in your specific example, it could be:\n```\ncheck that ins.dout_1[12:7] == (ins.din1_1 + ins.din2_1)[12:7]\n```\n\n"
        ]
    },
    {
        "title": "How to run e file one by one? Not in parallel test",
        "question": "I am new to specman, I am now writing a testbench which i want to give many specific test cases to debug a calculator.For example,I have two files, the first one called \"test1\" and the second called \"test2\".\nHere is my code for \"test1\":\n```\nextend instruction_s {\n       keep cmd_in_1 == ADD;\n       keep din1_1 < 10;\n       keep din2_1 < 10;\n};\nextend driver_u {\n       keep instructions_to_drive.size() == 10;\n};\n```\n\nAnd here is my code for \"test2\":\n```\nextend instruction_s {\n       keep cmd_in_1 == SUB;\n       keep din1_1 < 10;\n       keep din2_1 < 10;\n};\nextend driver_u {\n       keep instructions_to_drive.size() == 10;\n};\n```\n\nHowever, when I tried to test my code, specman shows error, it seems I can't do this like that. \nIs there any possible way that I can let specman execute \"test1\" file first and then run \"test2\" file? \nOr if there is some other way that I can achieve my goal?Thanks for your helping.",
        "accepted_answer": "Do you really want to have one test that executes 10 ADD instructions, and run another test that executes 10 SUB instructions?If so, the common way to do so is to compile your testbench, and run multiple times - each time loading another test file.For a start, try this:xrun my_device.v my_testbench.e test1.e\n xrun my_device.v my_testbench.e test2.e",
        "all_answers": []
    },
    {
        "title": "Error in ncelab: F*MISLUN: missing top level module, design unit name",
        "question": "I am trying to implement a reconfigurable module which changes its configuration according to user setup. Where I will have a huge if else ladder. When an user decides to shift the bits by 4 bits to right, all the values inside of the if else condition ladder also should change accordingly and the user does not have to change each and every value manually. One central change would be enough to make this happen.I have started with trying it out with function first, which is why I am yet to write finalize anything but having trouble with the error.Below you will find out the rtl and tb. I need help with two things:(1) Why I am getting this error in Cadence ncelab software?\n(2) What is the best way to adjust the values that exist inside of the \"if ... else\" condition? Because I will have a huge if else ladder.RTL:\n```\nmodule function_trial (clk,value_in, value_out\n);\n\ninput clk;\ninput value_in;\noutput value_out;\n\nreg [31:0] value_in;\nreg [31:0] c;\nreg [31:0] value_out;\n\nfunction [31:0] truncation; //The function truncates the last 4 lsbs\ninput [31:0] trunc_in;\n\nbegin\ntruncation = trunc_in >> 4;\nend\nendfunction\n\nalways @(value_in) begin\n\n    c = 32'h00000000;\n\nif (value_in >= truncation(32'h08000000) && value_in < truncation(32'h0A000000)) begin\n\n    c = 32'h00000001;\n\nend else if (value_in>= truncation(32'h0A000000) && value_in < truncation (32'h0C000000)) begin\n\n    c = 32'h00000002;\nend\nend\n\nassign value_out=c;\n\nendmodule\n```\n\nTB\n```\n`timescale 1ns/10ps\nmodule tb_function_trial (\n                    );\n\n\nreg  clk;\nreg  [ 31 : 0 ] value_in;  \nwire [ 31 : 0 ] value_out;\n\nfunction_trial function_trial_i (\n    .clk(clk),\n    .value_in(value_in),\n    .value_out(value_out)\n                  );\n\n\n parameter CLKPERIODE = 20;\n\n initial clk = 1'b1;\n always #(CLKPERIODE/2) clk = !clk;\n\n initial begin\n  value_in = 32'h00810000;\n#10\n  value_in = 32'h00B00000;\n#50 $finish();\n end\n\n `include \"testcase.v\"\n\n endmodule\n```\n\nIt is possible that I could not ask the question properly. Kindly let me know if you need more clarification.",
        "accepted_answer": "I see two errors in the code.reg [31:0] value_in;is wrong because it is an input and an input can not be of type 'reg'. You must change that to `wire'.reg [31:0] value_out;is wrong because you are using 'assign'. The target of an assign must be a wire not a reg. so that one also needs to change to `wire'.I can't match these error types to the error message in your title. I suspect these errors prevented the module from being generate and that may be the cause of the error message your have listed. In which case please check for additional error messages elsewhere.",
        "all_answers": []
    },
    {
        "title": "how to run multiple sp file using spectre",
        "question": "I have a bunch of.spfiles that need to be simulated with Cadence Spectre. Instead ofrun spectreas --\n```\nrun spectre 1.sp->exit->run spectre 2.sp->exit->...\n```\n\n-- is there some kind ofbatch modein Spectre so that i canlaunch Spectre once and execute these tasks sequentially (hold the spectre and run next task)? How can I achieve this?I need this because each time launching the Spectre it needs check the license and does other things, costing unnecessary time.Thanks in advance.error message:\n```\ninvalid command name \"if{!0}\"\nwhile executing\n\"if{![eof $log]} {\n    puts [gets $log]\n  } else {\n    close $log\n    incr event_flag\n  }\"\n    (procedure \"GetData\" line 3)\n    invoked from within\n\"GetData file3\"\ncan't wait for variable \"event_flag\": would wait forever\n    while executing\n```\n\n",
        "accepted_answer": null,
        "all_answers": [
            "You can use open command in tool interactive mode\n```\n#!/bin/sh  \n# \\\nexec tclsh \"$0\" ${1+\"$@\"}\n\nset event_flag 0 \n\nproc GetData {log} {\n    global event_flag\n    if {![eof $log]} {\n        puts [gets $log]\n    } else {\n        close $log\n        incr event_flag\n    }\n}\n\n# Run the following in loop   \nset log [open \"|spectre 1.sp\"]\nfconfigure $log -blocking 0\nfileevent $log readable [ list GetData $log ]\nvwait event_flag\n```\n\n"
        ]
    },
    {
        "title": "BLE cadence characteristic parsing iOS bluetooth Swift",
        "question": "I am trying to create an iOS app that reads a cadence sensor (Wahoo fitness cadence). This is bluetooth characteristic0x2A5B (CSC Measurement). In this example, cadence is how fast the pedals rotate on a bike.I am using the code below in Swift to read the characteristic from the sensor:Version 1:\n```\nprivate func cadence(from characteristic: CBCharacteristic) -> Int {\n\n    guard let characteristicData = characteristic.value else {return -1 }\n    let byteArray = [UInt8](characteristicData)\n    print(byteArray)\n\n    let firstBitValue = byteArray[1] & 0x01 //set bit 1 (not 0)\n    if firstBitValue == 1 { //IF crank revolution data is present, 1==true\n        return Int(byteArray[2])\n    } else {\n        return 0\n    }\n}\n```\n\nWhen I print byteArray, I get \"[2, 1, 0, 152, 11]\". the \"2\" and \"0\" never change. the \"1\" position increases and never decreases. The \"152\" and \"11\" positions seem to be completely random, never changing to 0. They do not change either when the crank is completely stopped. When reading the documentation, I expected the \"11\" to be the last event crank time. But it appears to not change despite how slow I spin the sensor.How can I use this data to get the cadence from the sensor?After working with Paul's help, I have made changes to the code and ended up at the result below:Version 2\n```\nfunc cadence(from characteristic:CBCharacteristic, previousRotations:Int = 0) -> (rpm:Double, rotations:Int)? {\n        guard let characteristicData = characteristic.value else {\n            return nil\n        }\n\n        let byteArray = [UInt8](characteristicData)\n        if  byteArray[0] & 0x02 == 2 {\n            // contains cadence data\n            let rotations = (Int(byteArray[2]) << 8) + Int(byteArray[1])\n            var deltaRotations = rotations - previousRotations\n            if deltaRotations < 0 {\n                deltaRotations += 65535\n            }\n            let timeInt = (Int(byteArray[4]) << 8) + Int(byteArray[3])\n            let timeMins =  Double(timeInt) / 1024.0 / 60.0\n            let rpm = Double(deltaRotations) / timeMins\n\n            return (rpm:rpm, rotations: rotations)\n        }\n        return nil\n}\n```\n\nThe RPM's being returned are currently below expected values, at around 53 being the highest, and 3 being the lowest. These values are compared to the sensor developer's app which indicates around 50-70 rpm.Version 3:\n```\nfunc cadence(from characteristic:CBCharacteristic, previousTime: Int=0, previousRotations:Int = 0) -> (rpm:Double, time: Int, rotations:Int)? {\n            guard let characteristicData = characteristic.value else {\n                return nil\n            }\n\n            let byteArray = [UInt8](characteristicData)\n            if  byteArray[0] & 0x02 == 2 {\n                // contains cadence data\n                let rotations = Int(byteArray[2])<<8 + Int(byteArray[1])\n                var deltaRotations = rotations - previousRotations\n                if deltaRotations < 0 {\n                    deltaRotations += 65535\n                }\n                let timeInt = Int(byteArray[4])<<8 + Int(byteArray[3])\n                var timeDelta = timeInt - previousTime\n                if (timeDelta < 0) {\n                    timeDelta += 65535\n                }\n\n                let timeMins =  Double(timeDelta) / 1024.0 / 60\n                let rpm = Double(deltaRotations) / timeMins\n\n                return (rpm:rpm, time: timeInt, rotations: rotations)\n            }\n            return nil\n        }\n```\n\n",
        "accepted_answer": null,
        "all_answers": [
            "This is what I ended up doing\n```\nfunc onCSC(from characteristic: CBCharacteristic) -> Double{\n    guard let characteristicData = characteristic.value else { return -1 }\n    let byteArray = [UInt8](characteristicData)\n    let firstBitValue  = byteArray[0] & 0x01 // Bit1 [2] == 0010 & 0000 == 0000 == 0 (Dec) Wheel Rev FALSE (For Spd)\n    let secondBitValue = byteArray[0] & 0x02 // Bit2 [2] == 0010 & 0010 == 0010 == 2 (Dec) Crank Rev TRUE  (For Cad)\n    \n    if firstBitValue > 0 {\n      let cumWheelRev   = Int(byteArray[3])<<8 + Int(byteArray[2])<<8 + Int(byteArray[1])<<8 + Int(byteArray[0])\n      let lastWheelTime = Int(byteArray[5])<<8 + Int(byteArray[4])\n      spdCSC = Double(getWheelRpm(pCumWheelRev: cumWheelRev,\n                                  pLastWheelTime: lastWheelTime,\n                                  pPrevCumWheelRev: prevCSCCumWheelRev,\n                                  pPrevWheelTime: prevCSCWheelTime,\n                                  hasPower: false)\n                          )        \n\n    // Store the current WheelRev & WheelTime for next iteration\n    prevComboCSCCumWheelRev = cumWheelRev\n    prevComboCSCWheelTime = lastWheelTime\n    }\n    \n    if secondBitValue > 0 {\n      let cumCrankRev   = Int(byteArray[2])<<8 + Int(byteArray[1])\n      let lastCrankTime = Int(byteArray[4])<<8 + Int(byteArray[3])\n      \n      var deltaRotations = cumCrankRev - prevCumCrankRev\n      if deltaRotations < 0 { deltaRotations += 65535 }\n      \n      var timeDelta = lastCrankTime - prevCrankTime\n      if (timeDelta < 0) { timeDelta += 65535 }\n      // In Case Cad Drops, we use PrevRPM \n      // to substitute (up to 2 seconds before reporting 0)\n      if (timeDelta != 0) {\n        prevCrankStaleness = 0\n        let timeMins =  Double(timeDelta) / 1024.0 / 60\n        rpm = Double(deltaRotations) / timeMins\n        prevRPM = rpm\n      } else if (timeDelta == 0 && prevCrankStaleness < 2 ) {\n        rpm = prevRPM\n        prevCrankStaleness += 1\n      } else if (prevCrankStaleness >= 2) {\n        rpm = 0.0\n      }\n\n      prevCumCrankRev = cumCrankRev\n      prevCrankTime = lastCrankTime\n      return rpm\n    }\n    return -1\n  }\n\n\n\n\nfunc getWheelRpm( pCumWheelRev: Int, pLastWheelTime: Int, pPrevCumWheelRev: Int, pPrevWheelTime: Int, hasPower: Bool ) -> Double {\n    let cumWheelRev = pCumWheelRev\n    let lastWheelTime = pLastWheelTime\n    let prevCumWheelRev = pPrevCumWheelRev\n    let prevWheelTime = pPrevWheelTime\n    var wheelRpm: Double = -1.0\n    \n    let deltaRotations = cumWheelRev - prevCumWheelRev\n    var timeDelta = lastWheelTime - prevWheelTime\n    if (timeDelta < 0) { timeDelta += 65535 }\n    \n    if (timeDelta != 0 && prevCumWheelRev != 0) { // Ignore the first data point cos prevCumWheeRev is always 0\n      // Alternate Calculation\n      // let timeMins =  Double(timeDelta) / 1024.0 / 60\n      // rpm1 = Double(deltaRotations) / timeMins\n      wheelRpm =  (hasPower ? 2048.0 : 1024.0) * (Double(deltaRotations) * 60.0) / Double(timeDelta)\n    }\n    //    print(\"1 getWheelRpm wheelRpm:\\(wheelRpm) deltaRotations:\\(deltaRotations)[\\(cumWheelRev) - \\(prevCumWheelRev)] timeDelta:\\(timeDelta) [\\(lastWheelTime) - \\(prevWheelTime)]\")\n    \n    return wheelRpm\n  }\n}\n```\n\nAccording to the specs from bluetooth.com\n```\n//  byte1 uint8: flags\n  //   bit 0 = 1: Wheel Revolution Data is present\n  //   bit 1 = 1: Crank Revolution Data is present\n  //\n  //   byte2/3 The next two fields are present only if bit 0 above is 1:\n  //    uint32: Cumulative Wheel Revolutions\n  //    uint16: Last Wheel Event Time, in 1024ths of a second\n  //\n  //   byte 3/4 The next two fields are present only if bit 10 above is 1:\n  //    uint16: Cumulative Crank Revolutions\n  //    uint16: Last Crank Event Time, in 1024ths of a second\n\n  //    Flag       : 2 (0x2)\n  //    CumWheel   : 6 (0x6)\n  //    LastWheel  : 0 (0x0)\n  //    CumCrank   : 231 (0xe7)\n  //    LastCrankTm: 30 (0x1e)\n```\n\n"
        ]
    },
    {
        "title": "Why am I getting \"debug domain is off\" error message when using Xtensa Tensilica OCD?",
        "question": "I'm trying to start Tensilica's Xtensa OCD Daemon by typing xt-ocd.exe in the appropriate directory but I keep getting a warning stating that \"Debug domain is OFF (PWRSTAT:0x0)!\" followed by an error message saying \"Cannot set JTAG Usable bit while debug module is off (PWRSTAT=0x0)!\". I have made sure that my external debugger is actually powered. It seems like the \"debug domain\" (whatever that means!) is off and I don't know how to turn it on. There's virtually no documentation on this.Has anyone had the same problem or does anyone know how to solve this issue? Thanks in advance.",
        "accepted_answer": null,
        "all_answers": [
            "I had this error when the Xtensa processor was in reset mode. Check to ensure that the processor is not in reset."
        ]
    },
    {
        "title": "Passing C structs through SystemVerilog DPI-C layer",
        "question": "SystemVerilog LRM has some examples that show how to pass structs in SystemVerilog to\\from C through DPI-C layer. However when I try my own example it seems to not work at all in Incisive or Vivado simulator (it does work in ModelSim). I wanted to know if I am doing something wrong, or if it is an issue with the Simulators. My example is as follow:\n```\n#include <stdio.h>\n\ntypedef struct {\n               char f1;\n               int f2;\n} s1;\n\nvoid SimpleFcn(const s1 * in,s1 * out){\n    printf(\"In the C function the struct in has f1: %d\\n\",in->f1);\n    printf(\"In the C function the struct in has f2: %d\\n\",in->f2);\n    out->f1=!(in->f1);\n    out->f2=in->f2+1;    \n}\n```\n\nI compile the above code into a shared library:\n```\ngcc -c -fPIC -Wall -ansi -pedantic -Wno-long-long -fwrapv -O0 dpi_top.c -o dpi_top.o\ngcc -shared -lm dpi_top.o -o dpi_top.so\n```\n\nAnd the SystemVerilog code:\n```\n`timescale 1ns / 1ns\ntypedef struct {\n               bit f1;\n               int f2;\n               } s1;\n\nimport \"DPI-C\" function void SimpleFcn(input s1 in,output s1 out);\n\nmodule top();\n  s1 in,out;\n  initial\n    begin    \n    in.f1=1'b0;  \n    in.f2 = 400;\n    $display(\"The input struct in SV has f1: %h and f2:%d\",in.f1,in.f2);\n    SimpleFcn(in,out);\n    $display(\"The output struct in SV has f1: %h and f2:%d\",out.f1,out.f2);\n end\n\nendmodule\n```\n\nIn Incisive I run it using irun:\n```\nirun -sv_lib ./dpi_top.so -sv ./top.sv\n```\n\nBut it SegV's.In Vivado I run it using\n```\nxvlog -sv ./top.sv \nxelab top -sv_root ./ -sv_lib dpi_top.so -R\n```\n\nIt runs fine until it exits simulation, then there is a memory corruption:\n```\nVivado Simulator 2017.4\nTime resolution is 1 ns\nrun -all\nThe input struct in SV has f1: 0 and f2:        400\nIn the C function the struct in has f1: 0\nIn the C function the struct in has f2: 400\nThe output struct in SV has f1: 1 and f2:        401\nexit\n*** Error in `xsim.dir/work.top/xsimk': double free or corruption (!prev): 0x00000000009da2c0 ***\n```\n\n",
        "accepted_answer": "You were lucky that this worked in Modelsim. Your SystemVerilog prototype does not match your C prototype. You havef1as abytein C andbitin SystemVerilog.Modelsim/Questa has a -dpiheader switch that produces a C header file that you can#includeinto your dpi_top.c file. That way you get a compiler error when the prototypes don't match instead of an unpredictable run-time error. This is the C prototype for your SV code.typedef struct {\n    svBit f1;\n    int f2;\n}  s1;\n\nvoid SimpleFcn(\n    const s1* in,\n    s1* out);But I would recommend sticking with C compatible types in SystemVerilog.",
        "all_answers": []
    },
    {
        "title": "Is it possible to fully compile a module and then instantiate it in a testbench separately?",
        "question": "Is it possible to make a fully compiled and standalone version of an RTL module, like a snapshot in Cadence terms, and then later instantiate this compiled module into a testbench?\nUltimately, running another compile step to create a final snapshot which contains the originally delivered snapshot but now instantiated in the testbench.If so, are there any special considerations when compiling the original snapshot to enable this and how would you instantiate such a compiled object within a testbench?",
        "accepted_answer": "Yes. But every simulation tool has slightly different approaches to the compilation flow. Most tools break this flow into a number steps: parsing, optimization, elaboration, and initialization (the snapshot you mention is the last step). Not all tools give you access to all the individual steps.There are several ways to achieve what you ask for, but the choice really depends on why you want to do this, and what limitations you are willing to work with.You can parse your module's source code into a library and then re-use that same library for compiling many different test benches. But usually the time consuming part is optimization.Questa provides what you are looking for in what they call the Pre-compiled Design Unit (PDU) flow. You can optimize your RTL module and save it back into a library, and Questa simply choses the optimized module instead of the un-optimized module during elaboration. The special considerations are that you need to preserve any signals from optimization that might have hierarchical references from the testbench.",
        "all_answers": []
    },
    {
        "title": "How to use an ideal diode in the virtuoso candence",
        "question": "I use the ideal diode  in the  virtuoso candence,but the log file show me an error when i simulate the circuit.\n```\n**error** (input.ckt:44) definition of model mydiode not found.Please specify a defined model name.\n```\n\nHere is my diode information,i don't know what is a \"defined model name\".",
        "accepted_answer": null,
        "all_answers": [
            "As far as I know, Cadence doesn't have an ideal model for a diode. You will need to use a diode from a PDK or create your own model file for a diode."
        ]
    },
    {
        "title": "name of skill function get list of master children layout cells used in current design",
        "question": "Does Cadence Virtuoso have a skill function to get  list of master children layout cells used in current design?I've tried to work withddGetObjChildrenbut this function returns children of datatypes for my top cell: schematic, abstract , etc.\nI need list of layout children masters used in this top cell.",
        "accepted_answer": "I got solution from Cadence Support Team!procedure( TrHierTraversal( cellView cellList )\n    foreach( master cellView~>instances~>master \n        let( ( nextCellView )\n            nextCellView =  master\n            cond(\n                ( !nextCellView nil )\n                ( member( nextCellView cellList ) nil )\n                ( t \n                  cellList = TrHierTraversal( nextCellView cons( nextCellView cellList ) )\n                ) ; t\n                ) ; cond\n           ) ; let\n        ) ; foreach \n    cellList ;;; return value - list of all master cells in hierarchy\n) ; procedure\n\nexpansion = TrHierTraversal( dbOpenCellViewByType( \"MAIN_LIB\" \"mux\" \"layout\" ) nil )\n\nforeach( item expansion printf(\"%L\" item~>cellName))",
        "all_answers": []
    },
    {
        "title": "Setting Probes for SimVision in SystemVerilog Code",
        "question": "I'm trying to probe the systemverilog signals by using irun .\nI came across the some example to dump wave as the below ,when I googling.\n```\ninitial begin                                                                 \n     $recordfile(\"sv_wave\");                                                  \n     $recordvars(\"depth=all\",pstest);                                         \n  end\n```\n\nIt seems work but the other variables can't see the value with \"No Value Available\".I use the below script to run the simulation.\n```\nirun \\                                                                         \n    +access+wrc \\                                                              \n    -cdn_vip_root /u572/cadence/installs/VIPCAT113 \\                     \n    /u572/sv/denaliMem.sv \\\n    /u572/sv/denaliCdn_ahb.sv \\    \n    /u572/svExamples/simpleExample/hdl/master_mux.v \\\n    /u572/svExamples/simpleExample/hdl/slave_mux.v \\\n    hdl/ahb_verilog.v \\                                                        \n    test2.v \\\n    tb.sv \\                                                                    \n    -incdir /u572/svExamples/simpleExample \\\n    -timescale 1ps/1ps -top pstest\n```\n\nWhat am I supposed to do to get the variable's value of the No Value Available variable?",
        "accepted_answer": "On the simulator side, the command you can use isprobe -create <signal> <options>. You can either type that in the irunsimulatorconsole or provide as an instruction in the.tclfile at startup. Refer to the documentation provided with the simulator under the sectionSimulator Tcl Commands/probefor verbose description & examples.",
        "all_answers": []
    },
    {
        "title": "How to make $display messages show up in SimVision console",
        "question": "I have to use the Cadence program suite to complete a Verilog class assignment and I'd like to know why$displaystatements in the very simple mock-testbench I have created do not produce output in the SimVision console window.My workflow goes like this:\nI have created a cell with the following functional view:\n```\nmodule tesbench ( );\n  initial begin\n    $display(\"RUNNING TESTBENCH\");\n    $finish;\n  end\nendmodule\n```\n\nI have then invoked NC-Verilog, initialized and netlisted and simulated the\ncell which opens the SimVision console window. Running the simulation then produces the following output:\n```\nncsim> run\nSimulation complete via $finish(1) at time 0 FS + 0\n/home/path/to/verilog/file.v:4      $finish;\nncsim>\n```\n\nSo$displayoutput is not shown. This seems like a very simple problem but I cannot for the life of me figure out what I'm doing wrong.",
        "accepted_answer": "Okay, so I have just been able to speak with an instructor and he told me that\nthis is a known problem with the installation and that there is currently no work-around (the programs are running on a server administrated by the university).",
        "all_answers": []
    },
    {
        "title": "How to generate a duplicate random number sequence between SystemVerilog simulators?",
        "question": "I cowork a SystemVerilog project with someone. However, I am used to use Synopsys VCS SystemVerilog simulator and he is used to use Cadence INCISIVE irun.One testbench module uses random numbers for generating test input pattern to top design module. Thus, I designed a class for generating random numbers:\n```\nclass RandData;\n    rand logic [3:0] randIn;\n    function new(int seed);\n        this.srandom(seed);\n    endfunction\nendclass\n```\n\nI can instantiate class RandData with a seed and get a fixed sequence of random numbers in simulations. However, the fixed random number sequence obtained by VCS is different from the fixed sequence by irun even if the same seed is used in two simulators.Unfortunately, the golden output pattern of the top design module depends on the test input pattern. Thus, if a golden output pattern is generated with an input pattern generated byVCS, the golden output pattern will bemismatchedto the top design output simulated byirun.Thus, how can I make VCS and irun simulators generate a duplicate sequence of random numbers?",
        "accepted_answer": "You should not be using golden output files with random stimulus; you need a self-checking testbench. Any change to the design or testbench might invalidate the previous golden output.",
        "all_answers": []
    },
    {
        "title": "How to get list of instance pins connected to net in Cadence Virtuoso schematic using SKILL",
        "question": "I have schematic with multiple instances connected to one of the nets.\nI need a SKILL function that will print for all instances list of pins connected to this net",
        "accepted_answer": null,
        "all_answers": [
            "Or shorter:\n```\nprocedure( ABC_findInstsAndPinsByNet(cvId netName)\n    let( (netId returnTable)\n        returnTable = makeTable(\"ABC_findInstsAndPinsByNet\" nil)\n        netId = dbFindNetByName(cvId netName)\n        foreach( termId netId~>instTerms\n            returnTable[termId~>inst] = cons(termId~>name returnTable[termId~>inst])\n        )\n\n        returnTable ;;return\n    )\n)\n```\n\nAnd then, to read it:\n```\nrezTbl = ABC_findInstsAndPinsByNet(cv() \"net2\")\nprintstruct(rezTbl)\n```\n\nand you will get something like:\n```\nprintstruct(rezTbl)\nStructure of type association table (table:ABC_findInstsAndPinsByNet):\n  db:0x3f04079b: (\"d\")\n  db:0x3f04079c: (\"d\" \"g\")\n  db:0x3f04079a: (\"s\")\nt\n```\n\nor if you want to parse all:\n```\nforeach( elem rezTbl\n    printf(\"%L => %L\\n\" elem rezTbl[elem])\n)\n```\n\n",
            "\n```\nprocedure(CCSgetListOfConnectedInstancePinsForNet(netname)\nlet((cv netid instid termid revhierarchy subcktPath pinHierName inst_list)\n    ;get cellview\n    cv = geGetEditCellView()\n\n    ; get netid\n    netid = dbFindNetByName(cv  netname)\n\n    foreach(inst netid~>allInstTerms~>inst\n        unless(member( inst inst_list )\n            inst_list = cons(inst inst_list)\n        );unless\n    );foreach\n\n    ;get instid\n    foreach(instid inst_list\n        ;printf(\"Instance %L\\n\" instid~>name )\n        foreach(term instid~>instTerms\n            when(car(term~>net~>sigNames) == netname\n                termid=term\n                ;printf(\"\\tNet %L is connected to terminal %L of Instance %L\\n\" netname termid~>name instid~>name )\n                revhierarchy = reverse(mapcar('car geGetHierMemInst()))\n                subcktPath = CCSgetSubcktPath(revhierarchy)\n                pinHierName=strcat( subcktPath instid~>name \"/\" termid~>name)\n                printf(\"%s\\n\" pinHierName)\n            );when\n        );foreach\n    );foreach\n    t\n);let\n);procedure\n\nprocedure(CCSgetSubcktPath(hierarchy)\n  let( (path)\n    path = buildString(reverse(hierarchy)~>name \"/\")\n    when(path != \"\"\n      path = strcat(\"/\" path \"/\")\n    ) ; end when\n    path\n  ) ; end let\n) ; end procedure\n```\n\n"
        ]
    },
    {
        "title": "How to copy list of cells between libraries and rename reference library using Cadence SKILL",
        "question": "I needed a SKILL script to copy Layout view of multiple cells from one library to another and than rename reference library. So I wrote one :)",
        "accepted_answer": null,
        "all_answers": [
            "\n```\n;Copy list of cells\nprocedure(copycells(source_lib destination_lib)\nlet( ( cell_list old_cell new_cell call_name oldSpec newSpec specList destination_lib objId)\n    cell_list=list(\n        \"HV_driver_dc2dc_fb\" \"dc2dc\" \"dc2dc_comparator\" \"dc2dc_core\" \"dc2dc_fb_cap_divider\" \"dc2dc_hv_curr_src\" \"dc2dc_low_side_switch_logic\"\n        \"dc2dc_ls_iso\" \"dc2dc_ocp_comparator\" \"dc2dc_ref_voltage_selector\" \"dc2dc_switch_and_diode\" \"dc2dc_top\" \"dc2dc_tst_tg\"\n        \"dc2dc_vref_amp\" \"dc2dc_vref_preamp\" \"doubler\" \"doubler_aux_bottom_driver\" \"doubler_core\" \"doubler_main_bottom_driver\"\n        \"doubler_main_cap\" \"dcdc_tst_mux\" \"dcdc_t6_tst_mux_tg_esd\" \"dcdc_t6_tst_mux_tg\"\n    )\n\n    specList = gdmCreateSpecList();Speclist for rename reference library function\n\n    foreach(call_name cell_list\n        ;This part needed only for version control managed labraries\n        objId = ddGetObj( destination_lib call_name \"layout\" \"*\" );;Get objId for layout view\n\n        unless( objId\n            error( \"** Unable to get objId of %s %s layout\\n\" destination_lib call_name )\n        );unless\n        when( ddNeedCheckout(objId)  ;If ccheckout needed old commend ufIsObjectCheckedIn(objId)\n            printf(\"Checking out %s cellView of %s %s\\n \" \"layout\" destination_lib  call_name)\n\n            unless(ddCheckout(objId);Check out\n                error( \"** Unable to get check out %s %s %s\\n\" destination_lib  call_name \"layout\")\n            );unless\n        );when\n        ;check out end\n\n        old_cell = dbOpenCellViewByType( source_lib call_name \"layout\" );Source cell\n        unless(old_cell error(\"Unable to open old cell\"))\n        printf(\"Copy %s %s to %s %s\\n\" source_lib call_name destination_lib call_name)\n        new_cell= dbCopyCellView( old_cell destination_lib call_name \"layout\" nil nil t );Copy cell\n        unless(new_cell error(\"Unable to copy %s\" call_name))\n        dbClose(old_cell);Close old ce;;\n        dbClose(new_cell);Close new cell\n        gdmAddSpecToSpecList(gdmCreateSpecFromDDID(ddGetObj(destination_lib call_name \"layout\")) specList);Add cell to SPEC list\n    );foreach\n    oldSpec = gdmCreateSpec( source_lib \"\" \"\" \"\" \"CDBA\" );Spec of source lib\n    newSpec = gdmCreateSpec( destination_lib \"\" \"\" \"\" \"CDBA\" );Spec of destination lib\n    ccpRenameReferenceLib(oldSpec newSpec specList 'CCP_VALID_BOTH_REFS);Rename reference library for target cells\n);let );copycells\n```\n\n"
        ]
    },
    {
        "title": "Why mixed signal output only changes at 1ns,2ns,3ns ...?",
        "question": "I'm trying to simulate analog & digital simulation (Cadence Virtuoso version 6)I make simple counter in verilog code and I succeed to check digital simulation.\nBut when I tried mixed signal simulation (using only 2 inverter chain for analog part for Clk // reset to digital counter), I found that the digital output only changed with multiple time of 1ns (1ns, 2ns, 3ns, 4ns)Even I make Clk period 100ps, counter changes only 1ns, 2ns, 3ns. (In verilog simulation, it was perfectly OKAY.)",
        "accepted_answer": null,
        "all_answers": [
            "Check your timescale. I expect you will have something like:\n`timescale 1ns / 1ns\nThe first value is the unit, the second the resolution.\nAs the initialization is different for digital and mixed signal simulators this might be different in both cases.\nOtherwise it might be due to the connect modules you probably have inserted between analog and digital domains (only in the ams case)."
        ]
    },
    {
        "title": "Cadence from BLE Device",
        "question": "\n```\n-(void)peripheral:(CBPeripheral *)peripheral didUpdateValueForCharacteristic:(CBCharacteristic *)characteristic error:(NSError *)error\n{\n     dispatch_async(dispatch_get_main_queue(), ^{\n\n         NSData *data = characteristic.value;\n         uint8_t *array = (uint8_t*) data.bytes;\n\n         cadenceValue = [CharacteristicReader readUInt8Value:&array];\n         self.cadence.text = [NSString stringWithFormat:@\"%d\", cadenceValue];\n         });\n}\n```\n\nHow to get cadence frombLE(Bluetooth low energy) device inswift 2. I am unable to find exact code for this. For thisdidUpdateValueForCharacteristicdelegate method is called.I have a code of nRF Toolbox but it is inobjective corswift 3but my project is inswift 2. I tried to call objective c method using bridging header but it was always returned 0 cadence.",
        "accepted_answer": null,
        "all_answers": [
            "I'm not sure the definition ofCharacteristicReader, but you might try:\n```\n[CharacteristicReader readUInt8Value:&array];\ncadenceValue = Int(array[0])\nself.cadence.text = [NSString stringWithFormat:@\"%d\", cadenceValue];\n```\n\nThe above assumes that the result of the call to readUInt8Value gets put into the array ofUInt8objects, and the cadence value is in the first byte of the array.  You could also check if the proper value is in other bytes by tryingcadenceValue = Int(array[1])orcadenceValue = Int(array[2]), etc."
        ]
    },
    {
        "title": "How to define a PDF in HSPICE with or without Verilog-A?",
        "question": "I have a pdf function which is an exponential function divided by a definite integral. I have two problems:1) How do I define my own PDF in HSPICE? ( I have found HSPICE has Gaussian distribution, but that's not what I am looking for)2) How do I solve a definite integral in HSPICE?Can I solve these two problems with a model in Verilog-A?Thanks in advance!",
        "accepted_answer": null,
        "all_answers": [
            "I've seen this modeled in SPICE using a generalized nonlinear current source and a 1-H inductor to perform the integration (C=L dI/dt).  Example:\n```\nG1 1 2 VALUE = {100uA*sin(V(3,2))}\nL1 1 3 1H\nR1 1 3 1ohm\n```\n\n"
        ]
    },
    {
        "title": "Is there a way to specify a library name in Incisive using command line interface?",
        "question": "In Modelsim I can specify a library name to be used, for example:\n```\nvlib MyPersonalLib\nvcom -work MyPersonalLib foo.vhd\nvsim MyPersonalLib.foo\n```\n\nIs there a way to do this in incisive without manipulating the hdl.var or cds.lib files?. Using -work for NCVHDL requires some prior setup of this files (ie: I get the error \"logical library name WORK is bound to a bad library\")",
        "accepted_answer": "you need to at least create the file - cds.lib. In the cds.lib you define the mapping of the work name to a physical directory. The directory must be created before the ncvlog is invoked.#cds.lib\nDEFINE MyPersonalLib ./MyPersonalLibthen you can run with the work library from command prompt.mkdir  ./MyPersonalLib\n\nncvlog your_file.v  -work MyPersonalLib -svYou will get a warning message ( if you have not created a hdl.var file) .*W,DLNOHV: Unable to find an 'hdl.var' file to load in.You can ignore it or use-NOWARN DLNOHVto suppress it.",
        "all_answers": []
    },
    {
        "title": "Can not launch Cadence",
        "question": "I am trying to start Cadence on my linux computer with Centos release 6.7. The problem I am having is after I type in icfb & on the terminal I am getting the below error which couldn't let me launch Cadence.\n```\n*WARNING* voInit failed to find the passwd entry for (null), using '/tmp' for a home directory.\nThe most likely cause of this problem is the failure of NIS lookups.\nPlease contact your system administrator.\n*WARNING* clsInit failed: Success\n*WARNING* file /home/john/CDS.log Success\n*WARNING* file /home/john/CDS.log.1 Success\n*WARNING* file /home/john/CDS.log.2 Success\n*WARNING* file /home/john/CDS.log.3 Success\n*WARNING* file /home/john/CDS.log.4 Success\n*WARNING* file /home/john/CDS.log.5 Success\n*WARNING* file /home/john/CDS.log.6 Success\n*WARNING* file /home/john/CDS.log.7 Success\n*WARNING* file /home/john/CDS.log.8 Success\n*WARNING* file /home/john/CDS.log.9 Success\nFailed to lock log file: /home/john/CDS.log.9\n```\n\nI will be very great full if anyone here can help me how to solve it.Sincerely,",
        "accepted_answer": null,
        "all_answers": [
            "Here's an article I found on sourcelink that seems to cover your error:The problem is related to the fact that winbind is being used as name service. Here is how the  /etc/nsswitch.conf file is configured:passwd:     files winbind\nshadow:     files winbind\ngroup:      files winbindThis also explains why the problem does not exist for local users. The solution is to go to the Winbind Authentication Configuration and  then in the Options tab turn on the following two flags:Cache User Information\nUse Shadow PasswordsIf systems are configured to use LDAP (i.e. passwd files ldap in nsswitch.conf) for user information and Kerberos for user authentication. We also need to verify certain shared object libraries are installed on the system. Most often it is solved by installing the 32 bit nss_libraries i.e. package nss_ldap.i386 - (64 bit version was already installed) for RHEL. This installs the /usr/lib/libnss_ldap.so required for the LDAP authentication.The new RHEL6 way of authenticating is not the libnss, but a newer tool SSSD. If the host use sssd to handle user authentication, the 32 bit version of libnss_sss.so should also be installed. It has been observed that the above errors could also come if the service calls \"nscd\" is not running for sssd.LINUX%   sudo yum install sssd-client.i686 nss-pam-ldapd.i686"
        ]
    },
    {
        "title": "coverpoint weight is not catching in simulator",
        "question": "I've written a coverage collection code that contains coverpoints and crosses , I don't want some of the coverpoints to affect the collection percentage , so I used option.weight=0 in them , but when I open the simulator , it tells me that the weight is 1 (default value) ! .\nwhy doesn't my change catch ?",
        "accepted_answer": null,
        "all_answers": [
            "You might be looking at per type coverage (as opposed to per instance coverage). In that case, you should settype_option.weight."
        ]
    },
    {
        "title": "Toggle Coverage not getting collected",
        "question": "I am using a Coverage Configuration file to collect code coverage explicitly by mentioning \"select_coverage -block -expression -toggle -module dut...\"Somehow, I am not able to get any number on toggle coverage for the dut.\nI even tried using instance name instead of module, but it didn't change a thing.These are few other settings that I have:->select_coverage -block -expr -toggle -fsm -module dut...->set_fsm_scoring -hold_transition->deselect_coverage -remove_empty_instances->deselect_coverage -expression -module A->set_implicit_block_scoring -off->set_expr_coverable_operators -event_or->set_expr_coverable_statements -all->set_libcell_scoring->set_assign_scoring->set_statement_scoring->set_parameterized_module_coverage->set_expr_scoring -struct->set_toggle_scoring -sv_enum->select_functional->set_covergroup -per_instance_default_one->set_covergroup -optimize_modelWould anyone have any idea what could possibly be stopping toggle coverage from being collected ?",
        "accepted_answer": null,
        "all_answers": [
            "After a lot of debug by examining the coverage DB in imc, I found that in an inadvertent mistake, the merge script did not pick up toggle coverage data.\nThe coverage was being collected fine."
        ]
    },
    {
        "title": "Ruby: type checkers arguments, akin to Cadence SKILL",
        "question": "In the Cadence SKILL (proprietary EDA language, based on LISP & SCHEME), one can define the argument types in a procedure.It will error out if the wrong type of argument is given. See shell report below:\n```\nprocedure( foo( ko \"t\" ) printf( \"Hey %s\\n\" ko ) )\n>foo\n>foo(\"1\")\n>Hey 1\n>t\nfoo(1)\n>*Error* foo: argument #1 should be a string (type template = \"t\") - 1\n```\n\nIs there something as nifty as that in Ruby? That is, in the method interface definition, not the body, the type checking is done?Thanks.",
        "accepted_answer": "You can make it \"nifty\" like this:module FirstArgumentIsAString\n  module Initializer\n    def initialize(word)\n      fail 'Word must be String' unless word.is_a?(String)\n      super\n    end\n  end\n\n  def self.included(klass)\n    klass.send :prepend, Initializer\n  end\nend\n\nclass Foo\n  include FirstArgumentIsAString\nend\n\ny = Foo.new(2)\n> Uncaught exception: Word must be String",
        "all_answers": []
    },
    {
        "title": "Distinguish and expand text macro nested in define macro",
        "question": "I would like to define a parameterMYTYPEusing text macro, whose value is passed over by text macro, eg\n```\n`define MY_FEATURE(nam,def) parameter nam=def;\n```\n\nand then\n```\n`MY_FEATURE(MYTYPE, 1)\n```\n\nBut the value is mixed by those who are defined by other text macros, eg\n```\n`MY_FEATURE(NEWTYPE, 2)\n`MY_FEATURE(MYTYPE, NEWTYPE)\n```\n\nThe latter case will not work unless thedefindefine MY_FEATUREis added with the directive dot.I need to distinguish this two different cases and automatically expand the macro - only if it is defined, so I came up with this code but I got error.\n```\n`define yea 1\n`define nop 0\n`define MY_FEATURE(nam,def) `ifdef def parameter nam=`def; `else parameter nam=2; `endif\n\nmodule test;\n\n  `MY_FEATURE(MYTYPE,yea)\n  initial begin\n    $display(\"%d\",MYTYPE);\n  end\nendmodule\n```\n\nThe above code works and gives a1as output. However if I write\n```\n`MY_FEATURE(MYTYPE,10)\n```\n\nsince for other cases I need to assign an actual number to the parameter, then I will get\n```\n`ifdef without a macro name - ignored.\n```\n\nMy desired result isMYTYPEis assigned as 10. \nIs there any way to achieve this? Thanks.Code can be found herehttp://www.edaplayground.com/x/6Jha",
        "accepted_answer": "I think you are overthinking it.`definecreates an directive expression. When when you pass a directive as parameter to another directive you can pass it as`yea.Here is an example:`define yea 1\n`define nop 0\n`define MY_FEATURE(nam,def) parameter nam=def;\n\nmodule test;\n  `MY_FEATURE(MYTYPE,`yea)\n  `MY_FEATURE(MYTYPE2,10)\n  `MY_FEATURE(MYTYPE3,MYTYPE+MYTYPE2)\n  initial begin\n    $display(\"%d %d %d\",MYTYPE, MYTYPE2, MYTYPE3); // displays: 1 10 11\n  end\nendmodulehttp://www.edaplayground.com/x/5PgfVerilog-AMS (superset of Verilog-A) is a language of its own, derived from Verilog (IEEE Std 1364); according themanual. This means yourMY_FEATUREnever creates new directives; it creates parameters. Directives and parameters are both treated as constants in simulation but act differently in compile. The`define/parametersrelation in Verilog (and Verilog derived languages) is equivalent toC's#define/constrelation. Unlike C, to access the value of a`definerequires a`prefix.Neither directives or parameters cannot start with a numeric value. The first character must be an alpha or underscore (aka[a-zA-Z_]). There for10can never be a directives and even trying to use it is illegal syntax. There is noway for the compile to recover from an illegal syntax directive name. This is way I suggested passing`yeainstead ofyea.If someone build you anicemodel, then it should come with equallynicedocumentation or some way of getting support.",
        "all_answers": []
    },
    {
        "title": "How to use SNAPSHOT of ncelab?",
        "question": "Now I'm trying to use the function of snapshot of ncelab of cadence.\nI found some special function about SNAPSHOT, so I tried so much with this. but I can't use the SNAPSHOT.So Would you let me know what about the usages of SNAPSHOT of ncelab of cadence?my verilog code is like as below.\n```\nmodule top();\n\nreg a;\nreg b;\nwire c;\n\nassign c = a+b;\n\n\nendmodule\n```\n\n",
        "accepted_answer": null,
        "all_answers": [
            "Cadence snapshot is more about saving the current state of the simulator and later on reusing the same state for resuming the simulation. It is used for the long run simulations to avoid issues with the tool crash/server issues.Snapshot is more like a checkpoint where you save a state and if something breaks later on, you can resume from this checkpoint instead of restarting backc from 0.On a side note, you can not change source code/compilation library etc. while doing the resume operation."
        ]
    },
    {
        "title": "Automatic pin placement with Layout XL in Cadence Virtuoso?",
        "question": "I have a big mixed signal design, with 363 pins. Layout XL knows the position of the pins (green line connects each pin with its correct position while I'm dragging it around).My question is: how can I avoid spending one week doing such a tedious activity and make pins placement automatic? I have always done it manually, but this time the design is too big. There MUST be a way to run a script, or issue a command from some menu, to save time and effort.",
        "accepted_answer": null,
        "all_answers": [
            "When you are in Layout XL, navigate to Connectivity/Update/Components And Nets. Click on the I/O pins tab and select all the pins you wish to have auto placed.  Define the layers for pins and labels that you desire and click update at the bottom right of the \"Specify Pins to be Generated\" tab.  Click OK.The pins you just generated will appear around the origin of the layout.  To auto place them according to the instances in your schematic, navigate to Place/Analog/Adjust Cell Pins."
        ]
    },
    {
        "title": "How to do linting with Questasim?",
        "question": "I was using linting tool HAL from Cadence. Now I have to use Questasim. But I don't know about the tools or switch that I can use for linting.Is there any toolfrom Mentor(Questaism) like HAL from Cadence (HAL is a separate tool for linting only).ORIs there any switchthat I have to use to enable Questasim for linting with any of these \"Vlog | Vopt| Vsim| Qverilog\".",
        "accepted_answer": null,
        "all_answers": [
            "Questasim Perform lint checking at lower level only,\n```\n-lint              Perform lint-style checks\n```\n\ni.e. vlog -lintBetter to go for standalone tool for linting."
        ]
    },
    {
        "title": "A yellow icon appears at toggle of signal in ncsim. Cant make out what is it?",
        "question": "I can see a yellow icon appearing at the toggle of a signal in my simulations. The icon shows a square wave like image. I tried to look up for an explanation, closest enough was \"zero pulse width\" but I am still unsure. No documentation explains what it is exactly and what causes it. Its not causing me any problem but I am just curious.\nDoes anyone have any idea ?",
        "accepted_answer": "This indicates that multiple transitions happened on the signal in the same simulation time step. This can be expanded to show the intermediate values. See this discussion on the Cadence forum:http://community.cadence.com/cadence_technology_forums/f/30/t/26894Some example code which shows the behavior:module test;\n\n   logic [1:0] bus;\n\n   initial begin\n      bus  = 2'b00;\n      #10;\n      for(int i = 0; i<8; i++) begin\n         bus     = bus + 1;\n      end\n      #10;\n      bus  = 2'b11;\n      #10;\n      $finish();\n   end\n\nendmoduleSimvision screenshots without and with the time expanded. To expand the time select \"Expand Sequence Time->All Time\" from the \"View\" menu.",
        "all_answers": []
    },
    {
        "title": "can cadence netlister si produce a flat verilog netlist?",
        "question": "i have a cadence schematic with hierarchy.  i am able to run the si netlister in batch mode at the command line to produce a hierarchical verilog netlist.  i was wondering if anyone knows if it is possible to produce a flat verilog netlist.  i have tried various options but can't seem to get it to work.  searches on google seem to give mixed opinions of whether this is possible or not.my si.env file for the hierarchical run is below:\n```\nsimLibName = \"myLib\"\nsimCellName = \"myCell\"\nsimViewName = \"schematic\"\nsimSimulator = \"verilog\"\nsimNotIncremental = 't\nsimReNetlistAll = 't\nsimViewList = '(\"gate\" \"functional\" \"verilog\" \"schematic\" \"symbol\")\nsimStopList = '(\"functional\" \"verilog\" \"symbol\")\nsimNetlistHier = t\nsimVerilogLaiLmsiNetlisting = 'nil\nverilogSimViewList = '(\"gate\" \"functional\" \"verilog\" \"schematic\" \"symbol\")\nsimVerilogAutoNetlisting = 't\nsimVerilogTestFixtureFlag = 'nil\nsimVerilogTestFixtureTemplate = \"All\"\nsimVerilogNetlistExplicit = 't\nhnlVerilogTermSyncUp = 'nil\nsimVerilogFlattenBuses = 'nil\nvtoolsUseUpperCaseFlag = 'nil\nhnlVerilogCreatePM = 'nil\nsimVerilogTopLevelModuleName = \"\"\nsimHierarchyPrefix = \"\"\nsimNCVerilogHierPrefix = \"\"\nverilogSimStopList = '(\"functional\" \"verilog\" \"symbol\")\nsimVerilogPwrNetList = '(\"vddin_sub!\" \"vddout_sub!\" \"vddin!\" \"vddout!\" \"vddin_sub\" \"vddout_sub\" \"vddin\" \"vddout\" \"vddfx\")\nsimVerilogGndNetList = '(\"vssfx!\" \"vss_sub!\" \"vssfx\" \"vss_sub\")\nvtoolsifForceReNetlisting = 'nil\nsimVerilogLibNames = '(\"stdcell_lib\")\nvlogifInternalTestFixtureFlag = 'nil\nsimVerilogBusJustificationStr = \"U\"\nsimVerilogTestFixtureTemplate = \"All\"\nsimVerilogDropPortRange = 't\nsimVerilogHandleUseLib = 'nil\nsimVerilogHandleAliasPort = 't\nsimVerilogPrintStimulusNameMappingTable = 'nil\nsimVerilogProcessNullPorts = 'nil\nsimVerilogIncrementalNetlistConfigList = 'nil\nhnlVerilogNetlistStopCellImplicit = 'nil\nsimVerilogOverWriteSchTimeScale = 'nil\nvlogifCompatibilityMode = \"4.0\"\nsimVerilogHandleSwitchRCData = 'nil\nvlogifUseAssignsForAlias = 'nil\nvlogifDeclareGlobalNetLocal = 'nil\nvlogifSkipTimingInfo = 'nil\nsimVerilogEnableEscapeNameMapping = 't\nsimVerilogStopAfterCompilation = 't\nsimVerilogVhdlImport = 'nil\nsimVerilogTopCellCounter = 0\nhnlSupportIterInst = 'nil\n```\n\nto be honest, i don't know what many of these options do.  i probably have things defined i don't need.  i literally just want it to netlist...don't need anything setup for simulation.google searches showed that i need to set fnl* instead of hnl* in some places but nothing was really specific about the recipe for getting this flat netlisting to work properly.wondering if anyone has experience with this and was able to get the flat verilog netlisting to work properly.thanks!",
        "accepted_answer": null,
        "all_answers": [
            "finally was able to get a straight answer from cadence.  the si netlist cannot create a flat verilog netlist unfortunately.  many have requested this feature be added, but it is not being actively worked on."
        ]
    },
    {
        "title": "Can I exclude static inputs(tied to a particular value) from being considered in toggle/expression coverage calculation in ncsim or modelsim?",
        "question": "I have a situation, where some inputs at DUT level arestatic(tied to one value) all throughout the simulation. My code coverage is reduced because these inputs will never see any toggling(being static).Is there any way (tool specific or some simulation argument) using which I can exclude just these inputs from being considered in calculating code coverage?I know, I can use a coverage control file and specify to deselect modules/instances there. But could I have the tool/code identify a static input and ignore it automatically?Expert opinion is welcome.",
        "accepted_answer": "There are formal tools that generate the waivers for you:https://www.mentor.com/products/fv/questa-covercheck/",
        "all_answers": []
    },
    {
        "title": "Double colon :: in Tcl",
        "question": "In some EDA tool's Tcl script (i.e Cadence Enounter), what does the double :: do?\n```\nreport::TimeStamp PrePlace \"START PrePlace\"\n```\n\n",
        "accepted_answer": null,
        "all_answers": [
            "It separates thenamespace(on the left) from thename(on the right) contained in that namespace.Since in a Tcl script any top-level construct is always a command, and the command's name is always the first word of the command, yourreport::TimeStamprefers to a command named \"TimeStamp\" in a namespace named \"report\" while \"PrePlace\" and \"START PrePlace\" are two arguments passed to that command when it's invoked.Namespaces in Tcl are dynamic entities and they may contain both commands and variables (and other namespaces)."
        ]
    },
    {
        "title": "Communicating with Program by command line using Python",
        "question": "I am trying to create a python script that will allow some interface with Cadence Skill (command line interface). I want any output to be directed to the shell. I feel like this should be simple, but I'm not able to get it working yet. WithPopenhowever, I can't see any output on the command line, and I'm not sure that thecommunicate()is properly sending the command. Here is what i have so far:\n```\nimport re, array\nimport sys\nfrom subprocess import call\nfrom subprocess import Popen, PIPE, STDOUT\nfrom threading  import Thread\nimport os\n\n#SET THESE VARIABLES\nLibraryPath = 'path_to_library'\nskillPath = 'path_to_cadence'\n\n#Cadence Environment path\ncadence_env= 'source /mscad/apps/bin/mscad_bash/cadtools --env cadence'\n\nclass cd:\n    \"\"\"Context manager for changing the current working directory\"\"\"\n    def __init__(self, newPath):\n        self.newPath = os.path.expanduser(newPath)\n\n    def __enter__(self):\n        self.savedPath = os.getcwd()\n        os.chdir(self.newPath)\n\n    def __exit__(self, etype, value, traceback):\n        os.chdir(self.savedPath)\n\n# Change to proper Cadence Directory\n\n# Debugging Variables\netype = 0; value = 0; traceback = 0\n\nNewPath = cd(LibraryPath)\nNewPath.__enter__()\n\n# Open Cadence Virtuoso in Shell Mode\n\ntry:\n    from Queue import Queue, Empty\nexcept ImportError:\n    from queue import Queue, Empty  # python 3.x\n\nON_POSIX = 'posix' in sys.builtin_module_names\n\ndef enqueue_output(out, queue):\n    for line in iter(out.readline, b''):\n        queue.put(line)\n    out.close()\n\np = Popen(['/bin/bash', '-i', '-c', 'cadence_env cmos12s0; virtuoso -nograph'], stdout=PIPE, bufsize=1, close_fds=ON_POSIX)\nq = Queue()\nt = Thread(target=enqueue_output, args=(p.stdout, q))\nt.daemon = True # thread dies with the program\nt.start()\n\n\n\n# read line without blocking\ntry:  line = q.get_nowait() # or q.get(timeout=.1)\nexcept Empty:\n    print('no output yet')\nelse: # got line\n    print(line)\n\nload_command = \"load(\\\"\"+skillPath+\"\\\")\"\nprint load_command\np.communicate(input=load_command)\nprint \"Command Sent ...\"\n\n\nNewPath.__exit__(etype, value, traceback)\ncall([\"ls -l\"], shell=True)\n```\n\nThanks in advance for the help.ReferencesNon-blocking read on a subprocess.PIPE in python",
        "accepted_answer": null,
        "all_answers": [
            "I was making it more complicated than it needed to be for my application; however the main problem I had was I was missing\\nwhen sending my command to the program. Also, removingstdout=PIPEallowed all the output of the program to go directly to the console.\n```\nproc = Popen(['/bin/bash', '-i', '-c', 'Command_To_Open_Program'], stdin=PIPE, stderr=STDOUT)\ncommand = \"command_to_program\\n\"\nproc.stdin.write(command)\n```\n\n"
        ]
    },
    {
        "title": "Test multiple Spice Models in different testbenches",
        "question": "I am new to cadence, and I am trying to figure out if there is an easy way to setup i.e. 5 testbenches where I can specify a list of spice models to run through the 5 testbenches?I am open to any solution, currently looking at bothADE XL,SKILLandOCEANtrying to find out what is possible.",
        "accepted_answer": null,
        "all_answers": [
            "Cadence has a Skill IDE here: CIW > Tools > Skill IDE. Look into the documentation for Skill. Once you find the command for simulating, you can use a for loop:\n```\nforeach(cellId ddGetObj(library_name)->cells\n\n    simulator('spectre)\n    design(library_name cellId->name \"schematic\")\n    ;Simulate Here\n\n)\n```\n\nYou will have to modify this loop for your purposes it is just an example.\nHope this gets you started."
        ]
    },
    {
        "title": "How to know direction of signal in Schemetic Tracer of simvision?",
        "question": "I am trying to tracing the signal at Schemetic Tracer in simvision(cadence).But It's really hard to find for some signal which have direction.\nIs there anyway to know the direction of port in Schemetic Tracer?",
        "accepted_answer": null,
        "all_answers": [
            "Yellow arrow on left of port name, pointing into box, input. Arrow on right of port name, output."
        ]
    },
    {
        "title": "P-Cell installation (FreePDK45)",
        "question": "I am trying to makethese instructionswork. I am having some difficulties along the way, it would be of great help if you could point me to the right direction!I have tried to follow the instructions in the web site. I did not quite understood the step 2 and 3.add the Python path to the first line of each script in this directoryI am not sure which python path is this. Is this$PDK_DIR/ncsu_basekit/gentech/sshaft/bin? And after trying a while, it seemed have created abinfolder:$PDK_DIR/ncsu_basekit/gentech/binand copied all*.pyfiles here.While updating theicoa_setup.csh, I have found that, I also needed tosourcethesetup.cshfile as well, otherwise theNCSU_TechLib_FreePDK45orNCSU_Devices_FreePDK45library do not load in Cadence Virtuoso.Finally, when I run the commandgentech.py -log gen.logfrom$PDK_DIR/ncsu_basekit/gentech, I am getting the following error:\n```\n/home/class/ahmed589/NCSU-FreePDK45-1.4/FreePDK45/ncsu_basekit/gentech/sshaft/bin/gentech.py: Permission denied\n```\n\nProbably because: the first line of thegentech.pyis not an executable file, rather a folder\n```\n#!/home/class/ahmed589/NCSU-FreePDK45-1.4/FreePDK45/ncsu_basekit/gentech/sshaft/src/py/\n```\n\nif the line is changed to\n```\n#!/home/class/ahmed589/NCSU-FreePDK45-1.4/FreePDK45/ncsu_basekit/gentech/sshaft/src/py/gentech.py\n```\n\nthen the following error message is found:\n```\nimport: Command not found.\nBadly placed ()'s.\n```\n\nMaybe the following info would be helpful:Operating system:Linux 2.6.32-573.3.1.el6.x86_64Cadence Virtuoso version6.1.5oaGetVersion :22.41.004Pycell studio version :2014.09-L4 of PyCell StudioPyCell Studio build with Python version:2.6.2 (r262:71600, Apr 7 2011, 14:30:04) [GCC 4.4.3]",
        "accepted_answer": null,
        "all_answers": [
            "The issue comes down you your misunderstanding of the instruction to \"add the Python path to the first line of each script in this directory\".  This is thepath to the Python executablewhich should be used in executing your scriptsThe first line of your script should be changed from --\n```\n#!/home/class/ahmed589/NCSU-FreePDK45-1.4/FreePDK45/ncsu_basekit/gentech/sshaft/src/py/\n```\n\n-- to referencethatpath; which is likely to be the output of --\n```\nwhich python\n```\n\n-- e.g., --\n```\n#!/usr/bin/python\n```\n\n"
        ]
    },
    {
        "title": "Difficulty in writing data to file in Ocean Script",
        "question": "The code below creates the file, but is not writing data to it.\n```\np=outfile(\"outfile.txt\" \"w\")\nfprintf(p \"write to out file\")\n```\n\n",
        "accepted_answer": null,
        "all_answers": [
            "Cadence uses buffered IO for files, so to see your output you will need to explicitly flush the port like so:\n```\ndrain(p)\n```\n\nThe port will also get automatically flushed when you close it, so this is only necessary if you want to see intermediate output."
        ]
    },
    {
        "title": "How to parallel multiple run with ncverilog?",
        "question": "I would like to run parallel multiple run ncverilog.Normally,  we use ncverilog run script like this.\n```\nRun.scr-\nncveriog blar~blar~\n```\n\nBut this is run at once. It means that if I want to run 100 scripts , I have to run new after previous script end. But I want to run at simultant 100 script.How do I run the scripts at simultant?",
        "accepted_answer": "UseGNU Parallelparallel ncverilog bla blaNormally, that will run as manyncverilogsin parallel as you have CPU cores, but you can add-j 25, for example, if you specifically want 25 to run in parallel.If you need to supply lots of different parameters, just make a loop or script that generates the parameters and feeds a list of jobs intoGNU Parallellike this:for i in {0..99}; do\n   echo ncverilog $i <and some other parameters>\ndone | parallel -j 25ExampleExampleDocumentation",
        "all_answers": []
    },
    {
        "title": "Wrong number of arguments for ::tcl::mathfunc::min in Cadence Encounter 14.2",
        "question": "I am writing a Tcl script that is executed by Cadence Encounter version 14.25 (or 14.20, depending on whether I look at the log file or the splash screen on startup...).The version of the embedded Tcl interpreter appears to be\n```\n% package require Tcl\n8.5.9\n```\n\nMy script uses the::tcl::mathfunc::minfunction, which, to my understanding, has a variable number of arguments, so for example the following should work (it does in my installation oftclshwhich has version 8.6.4):\n```\n% ::tcl::mathfunc::min 1 2 3\n1\n```\n\nHowever, when executed by Encounter, it seems that this is not the case and it only works for exactly two arguments:\n```\n% ::tcl::mathfunc::min 1 \ntoo few arguments for math function \"min\"\n% ::tcl::mathfunc::min 1 2\n1\n% ::tcl::mathfunc::min 1 2 3\ntoo many arguments for math function \"min\"\n```\n\nWhy is this so?Does the Tcl version reported by Encounter lie?Is Encounter's Tcl interpreter broken?Does::tcl::mathfunc::minonly support two arguments in Tcl versions prior to 8.6? All sources that look reliable to me state that it always had a variable number of arguments, for examplethis,this, orthat.Further investigations triggered byJackson's answer:In Encounter:\n```\n% info args ::tcl::mathfunc::min\n\"::tcl::mathfunc::min\" isn't a procedure\n```\n\nGreat! ...I discovered there is amincommand in the global scope that has the same behaviour, but different error messages:\n```\n% min 1\nwrong # args: should be \"min x y\"\n% min 1 2\n1\n% min 1 2 3\nwrong # args: should be \"min x y\"\n```\n\nNeither of the two (::min,::tcl::mathfunc::min) is contained in the result ofinterp aliases.",
        "accepted_answer": "Does the Tcl version reported by Encounter lie?Not necessarily. As with any command defined by Tcl,::tcl::mathfunc::mincan be redefined. Doesn't make it a good idea to do it, but it's legal to do so…Is Encounter's Tcl interpreter broken?In a minor way. I don't know why they did this.Does::tcl::mathfunc::minonly support two arguments in Tcl versions prior to 8.6?$ tclsh8.5\n% expr min(1,2,3,4,5)\n1Looks like it works fine with many arguments in 8.5 too. (It didn't exist in 8.4; theminfunction was introduced at the same time as the general function-to-command dispatch mechanism.)",
        "all_answers": []
    },
    {
        "title": "How to continue running the script inside the new shell that has been called from the same script?",
        "question": "I am a super newbie in this area so I apologize in advance for any dumb thing I might say! :DI work with Cadence's RTL Compiler and I am trying to automate the process of synthesizing so many designs with different sizes located in different directories, and producing the reports and save them in each folder. I am using tcl scripts to run the commands of the RTL program inside Linux terminal.First, I have to do some initializations outside the RTL environment. So I have created a script file calledsetup.tclthat I call from the Linux terminal and then call the RTL program itself (rc):\n```\nsource setup.tcl\nrc\n```\n\nThis will run the RTL compiler program inside the same terminal so now the compiler commands can be entered.\n```\nrc:/>\n```\n\nNow, I need a script for the RTL commands namedrtl_script.tclto run all the commands inside RTL environment and it will work just fine doing:\n```\nrc:/>source rtl_script.tcl\n```\n\nI need to run thewhole routinewith just one command so that I can loop it and everything.More precisely, a master script calledmaster.tclis needed that first runs thesetup.tcl, opens RTL Compiler, and then runsrtl_script.tclinside the rc environment. All done in the same terminal. Something like:\n```\nsource setup.tcl\nrc\nsource rtl_script.tcl\n```\n\nThe problem is that when I enter the commandsource master.tclthe shell stops after entering the RTL environment and it does not run thertl_script.tcl. Any help would be appreciated. Thanks.",
        "accepted_answer": null,
        "all_answers": [
            "I posted this question and I thought the answer should have something to do with different shells. But all I had to do, as @EtanReisner told me, was to giverccommand a script to run from but the correct syntax is like this:\n```\nrc -file rtl_script.tcl\n```\n\nIf you want your master script to continue after running afterrcfinishes, you have to have anexitcommand at the end ofrtl_script.tclscript.\nI had to take a closer look at the Cadence documentation."
        ]
    },
    {
        "title": "Specman-simulator synchronization issue?",
        "question": "I am using Cadence's Ethernet eVC wherein the agent's monitor is tapped at the following signals:\n```\n.            ____________                    _____\n.clk   _____|            |__________________|\n.      ________ _______ ________________ _________\n.data  __0a____X___07__X_______0b_______X_________\n.                      ^ ^\n```\n\nIt samples data at the rising and falling edges of the clock. In the example above, the data 0x07 is garbage data, and the valid values are 0xa (clk rise) and 0xb (clk fall). However, the monitor is sampling (for clk fall) 0x7!I'm suspecting this is a Specman-simulator synchronization issue. How can this be resolved if it is?Simulator - IES 13.10irun 13.10 options - (I'll include here only those which I think could be relevant to the issue, plus those which I've no idea yet what their purpose is)-nomxindr  \n-vhdlsync  \n+neg_tchk  \n-nontcglitch  \n+transport_path_delays  \n-notimezeroasrtmsg  \n-pli_export  \n-snstubelabLanguages - VHDL (top testbench), Verilog (DUT), Specman (virtual sequence, Enet and OCP eVCs)Time between 0x07 (left ^ in the waveform above) and falling edge of clock (right ^) = 0.098nsOne colleague suggested using-sntimescale, but I still can't imagine how that is causing/would resolve the issue. Any of these search strings were not showing helpful hints, even those articles from Cadence: \"specman tick synchronization delta delay timescale precision\"",
        "accepted_answer": null,
        "all_answers": [
            "This could be indeed an issue of timescale. \nThere is a comprehensive cookbook talking about deugging specman simulator interface synchronization issues. please take a lookhere.To check what is the timescale used in your simulation, you can add-print_hdl_precisionoption to irun to print the precision for the VHDL hierarchy. For Verilog, it will be printed automatically in case it is set either in the code or via irun options. the information will be printed during elaboration.To check the timescale used by Specman, you can issue the following command from Specman prompt:SN> print get_timescale()Another option to try (only after the timescale option doesn't help) is to remove the -vhdlsync flag. Indeed in most of the mixed environments you should add this flag. But there are rare cases in which the environment works better without it. If you try removing this flag, just remember to re-elaborate.If you don't find the solution for your problem in the cookbook, deeper investigation should be done. for example, how does specman samples the signal. is it a simple_port, event_port, tick access, etc.. also some trace and probe commands could be helpful. In such case, I suggest to contact Cadence support.Good Luck!Semadar"
        ]
    },
    {
        "title": "Cadence Virtuoso Layout L phantom objects",
        "question": "I have a cell (call itA) which is used once in a hierarchically higher cell (call itP).  When I placeAinP, its borders are rather larger than the actual content ofA.  When I descend toAand zoom-fit, it is way zoomed out, indicating there is something present way out on the edges.I may have dragged objects there at one point but currently there is nothing visible.  It is driving me crazy in terms of aligning objects, etc.Is there any way to clean this up or something?",
        "accepted_answer": null,
        "all_answers": [
            "If I recall Cadence used to have a problem with leaving steiners behind when you moved routes. They are not visible but the db treats them as real objects for the bbox calculation.  According to Cadence, deleting the objects should not harm anything. Open the layout in edit mode and paste this code into the CIW. This will delete all the steiner objects in your layout. If this was the root cause after saving you should see the bbox return to normal.\n```\ncv=geGetEditCellView()\nforeach( item cv~>steiners \n   dbDeleteObject( item )\n)\n```\n\n",
            "This thread may be considered \"dead,\" but hopefully this helps.It is possible the layers that are not visible are turned off.To turn them on, go to the layers pane on the left. (If it is not there you can turn it on by going toWindow—>Assistants—>Layers)You can then click the drop down arrow in the top right corner and clickEdit Valid Layers.Then, clickall validin theSet Valid Layerspopup. ClickOk.Finally, check theUsed Layers Onlycheckbox in theLayerspane. Look for any layers that weren't there before that you don't need.",
            "Usually it happens when you draw the cell in LayoutXL, particularly when you insert pins.Layer and purpose in these pins are selected separately for some reason, that is why it is easy to enter \"impossible\" combination.Nothing happens, then you do it again and continue drawing. But there are several invisible squares that will continuously frustrate your inner perfectionist. You do the following:Open this cell's layout, switch to Virtuoso window and enter:lppList=list()then:foreach(shape hiGetCurrentWindow()~>cellView~>shapes if( (member(shape~>lpp lppList)==nil) then lppList=cons(shape~>lpp lppList)))You have created the list with all layers in this layout, you can view it by entering:lppListYou'll get something like this:((\"NW\" \"drawing\") \n        (\"NP\" \"drawing\") \n        (\"weird\" \"guy\") \n        (\"M1\" \"pin\") \n        (\"M3\" \"pin\") \n    )If you find a weird guy in this company, just enter the following command:foreach(shape hiGetCurrentWindow()~>cellView~>shapes if((shape~>lpp == list(\"weird\" \"guy\")) shape~>lpp = list(\"prBoundary\" \"drawing\")))If you see that some squares, labels (or whatever unseen before) appears asprBoundary, just delete it, save, and your layout will be small and shiny again."
        ]
    },
    {
        "title": "running a 3 to 7 Decoder using a counter",
        "question": "I am trying to run my 3 to 7 decoder using the inputs coming from my counter ,all the individual codes run fine but the structural code is giving up some errorThis is the program for my counter\n```\nlibrary IEEE;\n\nuse IEEE.std_logic_1164.all;\n\nuse IEEE.std_logic_unsigned.all;\n\nentity counter is  \n   port(clk , CLR : in std_logic;\n   Q : out std_logic_vector(2 downto 0) );    \nend counter;\n\narchitecture archi of counter is\n\n    signal tmp: std_logic_vector(2 downto 0);  \n\n    begin      \n    process (clk, CLR)   \n         begin       \n\n         if (CLR='1') then                  \n             tmp <= \"000\";                       \n         elsif (clk'event and clk='1') then  \n              tmp <= tmp + 1;                     \n          end if;        \n\n     end process;   \n\n     Q <= tmp;\n\n end archi;\n```\n\nthis is the program for the decoder:\n```\nlibrary IEEE;\n\nuse IEEE.std_logic_1164.all;\n\nentity led_inp is\n\n    port (I : in std_logic_vector(2 downto 0) ;\n\n    L : out std_logic_vector(6 downto 0) ) ;\n\nend led_inp ;\n\narchitecture led_inp1 of led_inp is \n\nBegin    \n    L(0) <= (not I(0)) and (not I(1)) and (not I(2));   \n    L(1) <= (not I(0)) and (not I(1)) and I(2);\n    L(2) <= (not I(0)) and I(1) and (not I(2));\n    L(3) <= (not I(0)) and I(1) and I(2);\n    L(4) <= I(0) and (not I(1)) and (not I(2));\n    L(5) <= I(0) and (not I(1)) and I(2);\n    L(6) <= I(0) and I(1) and (not I(2));\nend led_inp1;\n```\n\nthis is the structural format for the whole design:\n```\nlibrary IEEE;\n\nuse IEEE.std_logic_1164.all;\n\n-- the entity of the whole design block, here i have given the names of the ports as the ones which i have used in my individual components \n\nentity led_design is  \n    port(clock,CLEAR :in std_logic;        \n    L :out std_logic_vector(6 downto 0));   \nend led_design; \n\narchitecture led_design1 of led_design is \n-- declaring my counter as a component \n   component counter   \n   port(clk, CLR : in std_logic;     \n   Q : out std_logic_vector(2 downto 0) );\n end component ;\n\n-- declaring my decoder as a component \n\ncomponent led_inp \n    port (I : in std_logic_vector(2 downto 0) ;\n    L : out std_logic_vector(6 downto 0)) ;\nend component  ;\n\nsignal I:std_logic_vector(2 downto 0);\nbegin \n    -- The PORT MAPPING BEGINS \n\n    L1: counter port map(clk=>clock,CLR=>CLEAR,I(2)=>I(2),I(1)=>I(1),I(0)=>I(0)); \n\n    L2: led_inp port map(I(2)=>I(2),I(1)=>I(1),I(0)=>I(0),L(0)=>L(0),L(1)=>L(1),L(2)=>L(2),L(3)=>L(3),L(4)=>L(4),L(5)=>L(5),L(6)=>L(6));\n\n    L1: counter port \n\n    map(clk=>clock,CLR=>CLEAR,I(2)=>h(2),I(1)=>h(1),I(0)=>h(0)); \nend led_design1;\n```\n\nthis is the error which comes up :ERRORncvhdl_p: *E,FMLBAD (led_count,85|44): poorly formed formal part of element association 87[4.3.3.2] 93[4.3.2.2].\n        errors: 1, warnings: 0\"",
        "accepted_answer": "Note the symbolled_countdoes not show up in your VHDL design description, is that the file name?You have two labels L1 in led_design, it's also missing a declaration for signal h to match signal I. (which also tells you it's not used anywhere else).Bothcounterassociation lists (port maps) don't match the component declaration. After fixing those things your code analyzes.  notehisn't used anywhere else.Read theMarkdown helpto learn how to format code, it's awful.The lack of proper formatting and the inability to understand the error is preventing those who could answer from providing an answer.Try this:library IEEE;\nuse IEEE.std_logic_1164.all;\n--use IEEE.std_logic_unsigned.all;\nuse ieee.numeric_std.all;\n\nentity counter is  \n   port(clk , CLR : in std_logic;    \n         Q : out std_logic_vector(2 downto 0) ); \nend counter;\n\narchitecture archi of counter is\n\n    signal tmp: std_logic_vector(2 downto 0);  \n\nbegin  \n\n    process (clk, CLR)   \n    begin       \n\n        if (CLR='1') then                \n            tmp <= \"000\";        \n        elsif (clk'event and clk='1') then      \n            tmp <= std_logic_vector(unsigned(tmp) + 1);             \n        end if;        \n\n    end process;   \n\n    Q <= tmp;\n\nend archi;\n\n\n\nlibrary IEEE;\nuse IEEE.std_logic_1164.all;\n\nentity led_inp is\n    port (I : in std_logic_vector(2 downto 0) ;\n          L : out std_logic_vector(6 downto 0) ) ;\nend led_inp ;\n\narchitecture led_inp1 of led_inp is \n\nBegin \n\n    L(0) <= (not I(0)) and (not I(1)) and (not I(2));\n    L(1) <= (not I(0)) and (not I(1)) and I(2);\n    L(2) <= (not I(0)) and I(1) and (not I(2));\n    L(3) <= (not I(0)) and I(1) and I(2);\n    L(4) <= I(0) and (not I(1)) and (not I(2));\n    L(5) <= I(0) and (not I(1)) and I(2);\n    L(6) <= I(0) and I(1) and (not I(2));\n\nend led_inp1;\n\n\n\n library IEEE;\n use IEEE.std_logic_1164.all;\n\n entity led_design is \n     port(clock,CLEAR :in std_logic;    \n          L :out std_logic_vector(6 downto 0));\n end led_design; \n\n architecture led_design1 of led_design is\n\n     component counter   \n         port(clk, CLR : in std_logic;     \n             Q : out std_logic_vector(2 downto 0) );\n     end component ;\n\n     component led_inp \n         port (I : in std_logic_vector(2 downto 0) ;\n               L : out std_logic_vector(6 downto 0)) ;\n     end component  ;\n\n     signal I:std_logic_vector(2 downto 0);\n     signal h:std_logic_vector(2 downto 0);\nbegin \n\nL1: counter port map (\n      clk=>clock,CLR=>CLEAR, Q => I); -- I(2)=>I(2),I(1)=>I(1),I(0)=>I(0)); \n\nL2: led_inp port map ( I(2)=>I(2),I(1)=>I(1),I(0)=>I(0),L(0)=>L(0),L(1)=>L(1),L(2)=>L(2),L(3)=>L(3),L(4)=>L(4),L(5)=>L(5),L(6)=>L(6));\n\nL3: counter port map( clk=>clock,CLR=>CLEAR, Q => h);-- I(2)=>h(2),I(1)=>h(1),I(0)=>h(0));\n-- ERROR \n--**ncvhdl_p: *E,FMLBAD (led_count,85|44): poorly formed formal part of element association 87[4.3.3.2] 93[4.3.2.2].\n--  errors: 1, warnings: 0\"**\n\n\nend led_design1;The use clause for numeric_std and the type conversions is to enable me to use a -1993 compliant tool (which doesn't have std_logic_unsigned). Those changes are likely not required in your environment.Notice the output of the second counter (connected toh) now labelled L3 does not go anywhere.Notice the error should also show up in your line 83 if you simply fix line 85.",
        "all_answers": []
    },
    {
        "title": "Setting Probes for SimVision in Verilog Code",
        "question": "I am working on simulations of verilog builded digital logic and need to restart a simulation very often to see the changes. I am using Cadence SimVision to review the waveforms.Is there a way to write commands in verilog for the SimVision environment? I mean things like probes and Parameters.",
        "accepted_answer": null,
        "all_answers": [
            "It is not Verilog but you can create a tcl file.shm.tcl:\n```\ndatabase -open waves -shm\nprobe -create your_top_level -depth all -all -shm -database waves\nrun \nexit\n```\n\nNow to run your simulation use:\n```\nirun -access +r testcase.sv -input shm.tcl\n```\n\n",
            "It's not standard Verilog, but the Cadence tools (ncvlog, ncsim, Incisive) will allow you to set probes from within the Verilog/SV source using a system call.Check for documentation for$shm_openand$shm_probe.\n```\ninitial begin\n  $shm_open(\"waves.shm\");\n  $shm_probe(\"AS\");\nend\n```\n\nThat said, the answer from @Morgan is the recommended way to do it so that you can control it at runtime."
        ]
    },
    {
        "title": "TCL script not working anymore",
        "question": "I used to run a tcl script for the Cadence tools on a server, however, now the script fails to run.The script is based on the following one:\n```\n#### Template Script for RTL->Gate-Level Flow\n#### all basic steps except for DFT-scan\n\n#### Fill in the <...> fields for your module \n#### and update library  search paths for your system\n\nif {[file exists /proc/cpuinfo]} {\n  sh grep \"model name\" /proc/cpuinfo\n  sh grep \"cpu MHz\"    /proc/cpuinfo\n}\n\n#### Set up\nset DESIGN test\nset SYN_EFF medium\nset MAP_EFF medium\nset DATE test\nset global_map_report 1\nset map_fancy_names 1\nset iopt_stats 1\n\nset SYN_PATH \".\"\nset _OUTPUTS_PATH outputs_${DATE}\nset _LOG_PATH logs_${DATE}\nset _REPORTS_PATH reports_${DATE}\n\nset_attribute lib_search_path {. ./lib} / \nset_attribute hdl_search_path {. ./rtl} /\nset_attribute information_level 7 /\nset_attribute map_timing true /\n\nset_attribute retime_reg_naming_suffix __retimed_reg /\nset_attribute library lib\n... continues\n```\n\nFirst I open acshin order to run a csh script to setup the Cadence tools on the server, then I runsource script.tcl. This used to work, however, now it fails with the following error:Missing ].And if I comment the firstif:set: Syntax Error.What may have changed in the server for this to happen and how can I fix this? The script did not change, so its syntax is correct.",
        "accepted_answer": "As your comments in code described, you should callsource script.tclinside the tool, not incshwhich doesn't understand Tcl syntax, nor intclshwhich doesn't understand those Cadence-specific Tcl commands.Also, the two linesh grep \"model name\" /proc/cpuinfo\nsh grep \"cpu MHz\"    /proc/cpuinfoshould beexec grep \"model name\" /proc/cpuinfo\nexec grep \"cpu MHz\"    /proc/cpuinfosinceexecis the correct Tcl command for calling shell commands.",
        "all_answers": []
    },
    {
        "title": "Illegal operand for constant expression",
        "question": "I'm trying to build a task, which must delve into some hierarchy, that can concisely compare different pins on a particular instance. In particular, I'd like to do something like the following:\n```\ntask check_expected;\n  input integer pin;\n  input [9:0] expected;\n  integer i, j;\n  reg [9:0] check;\n  begin\n    j = 0;\n\n    for (i = 0; i < 20; i = i + 1) begin\n      case (pin)\n        0: begin\n          check[0] = test.inst[i].lane_0.PIN_FIRST;\n          check[1] = test.inst[i].lane_1.PIN_FIRST;\n          ...\n          check[9] = test.inst[i].lane_9.PIN_FIRST;\n        end\n        1: begin\n          check[0] = test.inst[i].lane_0.PIN_SECOND;\n          check[1] = test.inst[i].lane_1.PIN_SECOND;\n          ...\n          check[9] = test.inst[i].lane_9.PIN_SECOND;\n        end\n        ...\n        9: begin\n          check[0] = test.inst[i].lane_0.PIN_TENTH;\n          check[1] = test.inst[i].lane_1.PIN_TENTH;\n          ...\n          check[9] = test.inst[i].lane_9.PIN_TENTH;\n        end\n      endcase\n\n      if (check[0] !== expected[j*10 + 0]) begin\n        TEST_FAILED = TEST_FAILED + 1;\n        $display(\"ERROR Expected=%b,  @ %0t\",expected[j*10 + 0],$time);\n      end\n      if (check[1] !== expected[j*10 + 1]) begin\n        TEST_FAILED = TEST_FAILED + 1;\n        $display(\"ERROR Expected=%b,  @ %0t\",expected[j*10 + 1],$time);\n      end\n      ...\n      if (check[9] !== expected[j*10 + 9]) begin\n        TEST_FAILED = TEST_FAILED + 1;\n        $display(\"ERROR Expected=%b,  @ %0t\",expected[j*10 + 9],$time);\n      end\n    end\n  end\nendtask\n```\n\nUnfortunately, attempting to do the above throws a NOTPAR error during elaboration, claiming that it is unacceptable to assign a register to a non-constant (it doesn't like any lines likecheck[0] = test.inst[i].lane_0.PIN_FIRST;). This is just for testing purposes, not anything synthesizeable, by the way.Can someone explain why this is disallowed and suggest a different solution? It's looking like I'll need to write a task for each and every loop iteration, and that seems like it would be needlessly bloated and ugly.Thanks",
        "accepted_answer": null,
        "all_answers": [
            "To answer my own question, the answer is that there is no way to do it with Verilog. Verilog is an incredibly dumb (in terms of capabilities) language, and, with a task, can only support constant indices for module instances. No looping is possible."
        ]
    },
    {
        "title": "connecting VHDL port to system verilog interface definition in UVM",
        "question": "I am having this issues in the Cadence tool chain simulation when I try to connect the multidimensional user defined type in VHDL to SystemVerilog in a UVM environment. This is the VHDL output type definition:\n```\nTYPE loop_reg_ty IS RECORD\n      loop_index_value    : std_logic_vector(REG_BITWIDTH-1 DOWNTO 0);\n      loop_counter : std_logic_vector(REG_BITWIDTH-1 DOWNTO 0);\n      loop_end_flag : std_logic;\nEND RECORD;\n\nTYPE loop_array_ty is array (MAX_NO_OF_LOOPS-1 downto 0) of loop_reg_ty;\n```\n\nOne of the VHDL output ports in my DUT is of typeloop_array_ty;I am trying to define the SystemVerilog equivalent as:\n```\ntypedef struct packed {\n                            bit [REG_BITWIDTH-1:0] loop_index_value;\n                            bit [REG_BITWIDTH-1:0] loop_counter;\n                            bit loop_end_flag;\n                          } raccu_loop_reg_ty;\n\ntypedef raccu_loop_reg_ty [MAX_NO_OF_RACCU_LOOPS-1:0] loop_array_ty;\n```\n\nWhen I useirun, I get the error:VHDL port type is not compatible with Verilog.Please suggest the possible work around solution.",
        "accepted_answer": "First, your problem is that you're not defining theloop_array_tycorrectly. It should betypedef raccu_loop_reg_ty loop_array_ty[MAX_NO_OF_RACCU_LOOPS-1:0].I would suggest 2 things here:First, try removing thepackedqualifier from thestructdefinition. Connecting SV structs to VHDL records is something that is only available in newer Incisive versions. Make sure that the version you're using supports this.If you're using an older version of Incisive (like I was a year back), your only choice is to map the individual record members using$nc_mirror(not tested code, but enough to get you started):// struct definition...\n// ...\n\nmodule top;\n  // intermediate signal we'll mirror onto\n  loop_array_ty loop_s;\n\n  // no output connected\n  my_dut dut_inst();\n\n  // make the connection between SV and VHDL using nc_mirror\n  initial begin\n    for (int i = 0; i < MAX_NO_OF_RACCU_LOOPS; i++) begin\n      $nc_mirror($sformatf(\"loop_s[%0d].loop_index_value\", i),\n        $sformatf(\"dut_inst.loop_o[%0d].loop_index_value\", i);\n\n      // $nc_mirror for loop_counter\n      // $nc_mirror for loop_end_flag\n    end\n  end\nendmoduleAlso make sure that you're setting theREG_BITWIDTHconstant appropriately in both languages, otherwise you'll also get a type mismatch.",
        "all_answers": []
    },
    {
        "title": "Find unused variables",
        "question": "I'm using the following tools for programing in verilog+system-verilog and I'm wondering which can detect which variables are not being in use:EclipseEclipse DVT extensionCadence tools",
        "accepted_answer": "I don't think DVT can detect unused variables, but AMIQ have another product called Verisimo that can do this, AFAIK.Also, try using the HAL (HDL Advanced Linter) from Cadence to see if they support this (it's a pretty basic thing for a linter).",
        "all_answers": []
    },
    {
        "title": "Synthesis error on a CASE statement in Verilog",
        "question": "I m  new in Verilog and I would like to know your opinion about an error I get when trying to synthesize the part of my code cited below:\n```\ninput [31:0] A;\nreg [31:0] X,Y;\nreg [15:0] width;\ninput action;       \n\nalways@*\nbegin\n\n  width= A [31:16]; \n  if (action==1)    \n  begin    \n    case (width) \n      16'b0: X=0;\n        default: \n          begin\n            for (i=32; i>=width+1 ; i=i-1)\n              X[i]=0;\n            for (i=width; i>=0; i=i-1)\n              X[i]=1;\n          end \n    endcase \n    Y=X >> 1;\n  end\nend\n```\n\nI m using Cadence synthesis tool and the error that i get is  in this part of my code saying :Index 'X[-1]' is not within the valid range of the declaration [31:0]which i don't understand because even ifwidth=0i have a special case that should not involve the for loop. i also tried increasing the limits towidth +2,width +1and thenshift the quantity X by 2..but also got the same error.Thank you in advance!",
        "accepted_answer": "I don't see howicould be -1, but it is possible for it to be greater than 31 which is out of range. There are couple of synthesis issues:i=32is already out of range forX[31:0]. Its MSB is 31.iwill go out of range whenwidth > 31.widthis a 16-bit unsigned value, meaning its maximum value is 65535(i.e. 216-1)and its minimum is 0.Synthesis requires loops to static unroll. This means the number of loops must be constant. Variables such aswidthcannot be in the loops condition.A synthesis-able for loop will look as follows:for (i=31; i>=0; i=i-1)\n  X[i] = (width>=i);I'm assuming thewidth= A [31:16];above the always block is a copy past typo as it is illegal syntax. I'm also assuming there are no additional assignments onwidth,X,Y, orioutside of the always block. Otherwise there are additional errors.",
        "all_answers": []
    },
    {
        "title": "execute tcl commands as soon as signal has some value in ncsim",
        "question": "As a modelsim user I am used to write something like the following lines in my do-file.\n```\nwhen -label supersignal {supersignal == '1'} {\n   stop ;\n   puts \"blah\"\n   do_something\n}\n\nrun -all\n```\n\nThat runs the simulation in modelsim and as soon as my VHDL-Signalsupersignalhas the value '1' the block starting withstop;will be executed.Is there a similar tcl command for (cadence) ncsim? I am looking for a command I can use within my dofile when callingncsim -input dofile.do.\nWhen I don't want to only stop the simulation, but also execute any tcl command.",
        "accepted_answer": "In ncsim you can usestop -create -object supersignal -silent -execute {\n  puts \"blah\"\n  do_something\n}That will not check for supersignal to be '1', but will trigger when there is any change to supersignal.\nSo if you want to check for the value explicitly you can create a condion first (see thecondition optionof stop or theconditioncommand to create new conditions)",
        "all_answers": []
    },
    {
        "title": "Command to send signals to waveform in SimVision",
        "question": "Is there a (Tcl-)command I can use to send signals to waveform in SimVision?\nOf course You can rightclick them and then select \"Send to WaveForm Window\", but to do that each time you start a simulation will be a pain.In Modelsim you can easily use \"add wave\" in a dofile (tcl file), but strange if there would be no way to do this with ncsim...",
        "accepted_answer": null,
        "all_answers": [
            "a minimal working example I've come up with:\n```\nwindow new WaveWindow -name \"Waveform\"\n    waveform using {Waveform}\n    waveform add -signals tb_foo_u.module_bar_u.signal_xyz\n```\n\nYou can type that in the SimVision console (if you're using irun in GUI mode). Tested in 15.20. Those are simulator-specific commands.If you want it to be done automatically @ irun startup (using .tcl file), examine the results of running commands from the other answer, then tailor it to your needs.For the full, verbose description ofwaveforminstruction, refer to the documentation provided with the simulator underSimVision Tcl Commands/waveform.",
            "When you have your waveform window set up the way you like (with all desired signals), you can go to File -> Save Command Script .  This will save your window setup as a tcl file.  You can look in there to see what the tcl commands are if you are interested in doing it manually.To restore the waveform window next time, simply go to File -> Source Command Script and select the file you had saved previously.\nNote: I'm using SimVision 12.10"
        ]
    },
    {
        "title": "Is there a way to use one testbench for different simulators if both simulators need their own packages to be used?",
        "question": "My testbench uses a function that is defined in a modelsim package (init_signal_spy). So I can't use this testbench with a different simulator than ModelSims vsim, for example Candence's ncsim. But there is an equivalent function for ncsim (nc_mirror) in the cadence packages. The solution is that I need to have two different testbenches.But I want to use only one.\nOne solution could be, to define a package only if some constant is set. But I don't know if that is possible.",
        "accepted_answer": "The general way to make proprietary functions from different vendors appear the same in a test bench, is to use a wrapper package that converts the functions to a function interface that you define.To support both ModelSim and NCSim, you create three files:wrap.vhdwrap_modelsim.vhdwrap_ncsim.vhdThepackage wrapinterface is defined in \"wrap.vhd\", thus with a common interface to functions, independent of the simulator.  Thepackage body wrapis then defined in \"wrap_modelsim.vhd\" and \"wrap_ncsim.vhd\", with implementation depending on simulator.When compiling, only the appropriate package body file is used, depending on the simulator.The test bench thenuse work.wrappackage, and can access the converted functions throughwrap.{function}.",
        "all_answers": []
    },
    {
        "title": "Get internal signals of vhdl design in ncvhdl (alternative to modelsim's signal spy)",
        "question": "In ModelSim you can use something likein modelsim we can use\ninit_signal_spy(\"../.../sig\", mysignal);to get deep hierarchy signals.\nIs there a way to get such signals with Cadence's NCVhdl?This should be flagged \"SimVision\", which is the name the tool, but that flag does not seem to exist.",
        "accepted_answer": "If Cadence tools support VHDL-2008, you can access signals, shared variables, or constants in other levels of your design via external names.Direct usage is as follows.A <= <<signal .tb_top.u_comp1.my_sig : std_logic_vector >>;Note that the object must be elaborated before the reference.  Since VHDL designs are elaborated in order of instantiation later designs may reference into earlier ones.Use an alias to create a local short hand name:alias u1_my_sig is <<signal u1.my_sig : std_logic_vector >>;Path starts with:“.” = path starts at top level: “.tb_top.my_sig”“u1” = path starts from current level: “u1.my_sig”“^” = path starts from level above current:  “^u2.my_sig”",
        "all_answers": []
    },
    {
        "title": "SystemVerilog: Parameter used in concatenation gives error with irun",
        "question": "Cadence irun gives error for below code, where fifo_depth_base2 is parameter as below:ncvlog: *E,NONOWD (buff_mgr.v,17|46): Illegal use of a constant without an explicit width specification [4.1.14(IEEE)].I can understand this error, but my question is how would I otherwise assign it for parameterized design.\n```\n// rd pointer and read logic\nalways @(posedge clk or posedge rst) begin\n    if(rst) rd_ptr <= 0;\nelse begin  \n    case({flush, rd})\n        2'b10, 2'b11: rd_ptr <= {fifo_depth_base2{'b0}}; // error here\n        ...\n endcase\nend\nend\n```\n\n",
        "accepted_answer": null,
        "all_answers": [
            "You are missing a 1 before'b0. The simulator doesn't know the bit size of'b0because it is not specified.{fifo_depth_base2{'b0}};should be{fifo_depth_base2{1'b0}};With SystemVerilog you can use:rd_ptr <= '0;, where'0means fill zeros"
        ]
    },
    {
        "title": "How can we add functional coverage while running simulation using NCSIM",
        "question": "I am trying to run a coverage regression using the NC tool from Cadence. I can see RTL coverage, but functional coverage in the scoreboard is missing. How can I add this scoreboard to thecovdutoption in NCSIM arguments?  The scoreboard contains covergroups.",
        "accepted_answer": "By default, Incisive does not collect functional coverage.  You need to enable it with thecompile-time-covfileoption, specifyingselect_functional.Also, in the source code, you must explicitly call thesamplefunction on all covergroups (this applies to all simulators).",
        "all_answers": []
    },
    {
        "title": "Line overflow in Cadence EDI",
        "question": "I am working on a script in Cadence EDI tool (this is TCL based i.e. the EDI shell is TCL based). My code looks something like-\n```\nnamespace eval clockgatecloning {\n....\n.....\n......\n...\n}\n```\n\nThere are a number of nested statements, procs calling each other.\nNow I am working on a big database which is providing a set of data each time to this code and this happens roughly 5000 times. I left my code running overnight as it ran properly (dumping out some data on the shell at each iteration. However today when I checked, there was this message displayed-\n```\n<<: Line overflow.\n```\n\nIs this an error? Has my run completed? This has happened before once and I have no clue why. Has it something got to do with memory ?Please help me out.",
        "accepted_answer": null,
        "all_answers": [
            "Tcl itself does not have limits on the length of lines; if you want a line many megabytes long, you can have it. (It's probably not a good idea if you don't strictly need it, but that's your call.) This applies to both lines in scripts and lines in data files. The main limits have to do with how much memory you've got, and exceeding them won't produce that error message. Indeed, that message is not present anywhere in the Tcl source code.It's entirely possible that Cadence EDI may have its own limits, but these are more likely to be somewhere like logging or in parts that are not Tcl-related (though they are obviously accessed via some interface that ends up exposed to the Tcl level).",
            "The code is 1000 lines plus and basically is performing an operation on clock-gates in a design in EDI. There are around 5000 clock-gates to clone in the design (the operation is cloning and reassigning the sinks of 1 clock-gate to its new clones).EDI runs on a load sharing facility to which I have allotted some memory for this task.Ideally, when the code runs, a message for each clock-gate is dumped to the EDI shell implying that is making changes to the design. A snapshot of this is-Flip instance u_cheetah_core/uvincero_mpupd/uvincero_cpu_l2/uCORTEXA9MP/u_falcon_cpu_power_wrapper0/u_cpu/u_noram/u_core/u_de/u_neon/umcr_mrc_if/RC_CG_HIER_INST1390/RC_CGIC_INST_1 to match row orient.\nFlip instance u_cheetah_core/uvincero_mpupd/uvincero_cpu_l2/uCORTEXA9MP/u_falcon_cpu_power_wrapper0/u_cpu/u_noram/u_core/u_de/u_neon/uniq/RC_CG_HIER_INST1401/RC_CGIC_INST_1 to match row orient.\nFlip instance u_cheetah_core/uvincero_mpupd/uvincero_cpu_l2/uCORTEXA9MP/u_falcon_cpu_power_wrapper0/u_cpu/u_noram/u_core/u_de/u_neon/uniq/RC_CG_HIER_INST1402/RC_CGIC_INST_2 to match row orient.\nFlip instance u_cheetah_core/uvincero_mpupd/uvincero_cpu_l2/uCORTEXA9MP/u_falcon_cpu_power_wrapper0/u_cpu/u_noram/u_core/u_de/u_neon/uniq/RC_CG_HIER_INST1404/RC_CGIC_INST_1 to match row orient.\nFlip instance u_cheetah_core/uvincero_mpupd/uvincero_cpu_l2/uCORTEXA9MP/u_falcon_cpu_power_wrapper0/u_cpu/u_noram/u_core/u_de/u_neon/uniq/RC_CG_HIER_INST1405/RC_CGIC_INST_1 to match row orient.Today morning when I checked the shell, I realised that it had exitted the code with this message-:>> Line Overflow.I checked the EDI log file and even there it showed a similar message."
        ]
    },
    {
        "title": "Infinite Loop in TCL/EDI",
        "question": "I am writing a script in TCL that is sourced into Cadence's Encounter Digital Implementation Shell. It recursively executes a number of TCL procs and all of a sudden exits the code saying- 'Too many nested evaluations (infinite loop?)'. I located the proc where it errors out and checked the variables being passed as arguments. All values are normal.I am attaching the part of the proc where it is erroring out. (THe entire script is 1000 lines+ so only mentioning this part).\n```\nfor {set i 1} {$i<=[llength $xcoord_sinks_for_clone($clone_to_regroup_ref)]} {incr i} {\n        set abs_dist_list($i) \"\"\n        set count 0\n\n        foreach clone $new_clone_index_ref2 {\n            set dist($i) [expr [distance [lindex $xcoord_sinks_for_clone($clone_to_regroup_ref) [expr $i-1]] [lindex $xcoord_clones [expr $clone_to_regroup_ref-1]] [lindex $ycoord_sinks_for_clone($clone_to_regroup_ref) [expr $i-1]] [lindex $ycoord_clones [expr $clone_to_regroup_ref-1]]]-[distance [lindex $xcoord_sinks_for_clone($clone_to_regroup_ref) [expr $i-1]] [lindex $xcoord_clones [expr $clone-1]] [lindex $ycoord_sinks_for_clone($clone_to_regroup_ref) [expr $i-1]] [lindex $ycoord_clones [expr $clone-1]]]]\n            set dist_abs($i) [expr abs($dist($i))]\n            lappend abs_dist_list($i) $dist_abs($i)\n            incr count\n        }\n        set sorted_dist_abs($i) [lsort -real $abs_dist_list($i)]\n        lappend min_dist [lindex $sorted_dist_abs($i) 0]\n    }\n```\n\nI was able to pin-point the location of the error. Everything happens according to the script till right before the 'set dist($i).....' assignment inside the foreach loop.Is there some memory-allocation problem? ( The script is running on a Load Sharing Facility)Please help me out!!",
        "accepted_answer": null,
        "all_answers": [
            "If you get an error about recursion, that means a function is calling itself. If the code you posted is part of thedistanceproc, and the code callsdistanceitself, that could be the problem.",
            "You could try to increase your recursion limit, e.g.:\n```\nset old_limit [interp recursionlimit {}]\nset limit_increment 2000\ninterp recursionlimit {} [expr {$old_limit + $limit_increment}]\n\n# execute recursive procedure\n\ninterp recursionlimit {} $old_limit\n```\n\n"
        ]
    },
    {
        "title": "VHDL code in NCLaunch giving errors not given in Xilinx",
        "question": "I am trying to make a dataflow design for a comparator in VHDL. It compiles and simulates fine in Xilinx, but I have to use Cadence/NCLaunch. When I copied the same code to gedit and ran it, it gives an error about a semicolon.my code is :\n```\nlibrary ieee;\nuse ieee.std_logic_1164.all;\n-----------------------------------------------------\nentity Comparator is\nport(   A:    in std_logic_vector (3 downto 0);\n        B:    in std_logic_vector (3 downto 0);\n        AeqB:  out std_logic;\n    AltB:  out std_logic;\n    AgtB:  out std_logic);\nend Comparator;\n\n\narchitecture dataflow of Comparator is\n\nsignal AeB : std_logic;\nsignal AlB : std_logic;\nsignal AgB : std_logic;\nsignal i : std_logic_vector (3 downto 0);\nsignal j : std_logic_vector (3 downto 0);\n\nbegin\n    B1: BLOCK BEGIN   \n        AeB <= i(3) AND i(2) AND i(1) and i(0);\n        AgB <= j(3) or j(2) or j(1) or j(0);\n        AlB <= AeB nor AgB;\n    END BLOCK B1;\n\n\n    B2: BLOCK BEGIN\n            i <= a xnor b;\n    END BLOCK B2;\n\n\n    B3: BLOCK BEGIN\n        j(3) <= (not b(3)) and a(3);\n        j(2) <= i(3) and not b(2) and a(2);\n        j(1) <= i(3) and i(2) and not b(1) and a(1);\n        j(0) <= i(3) and i(2) and i(1) and not b(0) and a(0);       \n    END BLOCK B3;\n\n\n    B4: BLOCK BEGIN\n        AeqB <= AeB;\n        AltB <= AlB;\n        AgTB <= AgB;\n    END BLOCK B4;\n\n\nend dataflow;\n```\n\n...and the error I get is:\n```\ni <= a xnor b;\n       |\nncvhdl_p: *E,EXPSMI (/ugrad/syedhuq/ECE425/Lab2/Comparator.vhd,29|11): expecting a semicolon (';') [9.5.1].\n```\n\nAs far as I can tell, I have a semicolon there...also if I replace the statement with four individual statements like\n```\ni(n) <= a(n) xnor b(n); //[n = 1, 2, 3, 4],\n```\n\ni get the same error 4 times. Can anyone help me out with this??Also, it compiles fine in Synopsys (VCSMX) and so does the testbench file, but during the linking process it tells me :\n```\nDesign unit 'COMPARATOR(BEHAVE)' from library '.' cannot be opened for \n  reading.\n  Possible causes:\n  [1] Incorrect logical to physical mapping in synopsys_sim.setup file. \n  [2] Intermediate file generation was prematurely terminated during analysis.\n  Reanalyze the design unit and resolve any errors that occur during analysis.\n```\n\nthe relevant line from the testbench code is:\n```\nfor x1: Comparator use entity work.Comparator(Behave);\n```\n\n",
        "accepted_answer": "I'm not familiar with Cadence/NCLaunch, but knowing your code analyzes correctly in an IEEE 1076-1993 compliant tool, and noting where error is (you indicated character position 11 in line 29, noting it appears to be character position 17), I'd say off hand it either doesn't have \"xnor\" un-commented in package std_logic_1164 (both the specification and the body), or it's a VHDL87 compliant tool, or there's some missing tool set or command line argument to use use the proper std_logic_1164 package.In the distributed source for std_logic_1164, available fromhttp://standards.ieee.org/downloads/1076/1076.2-1996/-- --------------------------------------------------------------------\n--  version | mod. date:| \n--   v4.200 | 01/02/92  | \n-- --------------------------------------------------------------------You'll find that xnor is commented out by default, when after VHDL92 (-1993, don't ask) was approved it was supposed to be un-commented.--  -----------------------------------------------------------------------\n--  Note : The declaration and implementation of the \"xnor\" function is\n--  specifically commented until at which time the VHDL language has been\n--  officially adopted as containing such a function. At such a point, \n--  the following comments may be removed along with this notice without\n--  further \"official\" ballotting of this std_logic_1164 package. It is\n--  the intent of this effort to provide such a function once it becomes\n--  available in the VHDL standard.\n--  -----------------------------------------------------------------------\n--  function \"xnor\" ( l, r : std_logic_vector  ) return std_logic_vector;\n--  function \"xnor\" ( l, r : std_ulogic_vector ) return std_ulogic_vector;9.5.1 refers to Conditional signal assigns in IEEE=1076-1993.The analyzer is acting like it doesn't recognize xnor as a operator and if you look in -1993 7.2.1 Logical operators:The logical operators and, or, nand, nor,xor, xnor, and not are\n  defined for predefined types BIT and BOOLEAN. They are also defined\n  for any one-dimensional array type whose element type is BIT or\n  BOOLEAN.Which tells us in an IEEE 1076-1993 compliant tool the declarations for xnor would come from the std_logic_1164 package.I had a quick gander through some NCSIM, etc. online user guides and tutorials and didn't see anything relating to the problem.  It's likely the std_logic_1164 package hadn't had xnor un-commented in both the declaration and body.The issue may be the the providence (age) or the particular tool copy you are using and may require sysadmin help to correct. In the mean time you can either write your own xnor function (shown), if running into any difficulties try and use not( a xor b) instead.architecture dataflow of Comparator is\n\n\nfunction \"xnor\"  ( l : std_logic; r : std_logic ) return ux01 is\nbegin\n    return not (l xor r);\nend \"xnor\";\n\nsignal AeB : std_logic;\nsignal AlB : std_logic;\nsignal AgB : std_logic;\nsignal i : std_logic_vector (3 downto 0);\nsignal j : std_logic_vector (3 downto 0);\n\nbeginAlso seeWeird XNOR behaviour in VHDL",
        "all_answers": []
    },
    {
        "title": "Adjusting the operating frequency of a module in Verilog",
        "question": "I am creating a fairly complicated module which involves timing analysis of 2 Modules each having their own algorithm, but take in 2 signed numbers as inputs and output a signed number.I am designing this module for an FPGA in Verilog using Xilinx as my synthesis tool. Now I understand that Xilinx usually gives the worst case timing analysis for any module. This means that if I have a range of numbers which take 250 picoseconds, from input to output including the routing time, if there is even a single set of inputs that takes 400 picoseconds, the timing analysis shown by Xilinx would be 400 picoseconds.My goal is to find:1) If Module 1 is faster than Module 2 for any set of numbers.1) Range of numbers for which Module 1 is faster than Module 2.The only logical approach I can think of is, by increasing the operating frequency of the module. That is to force both the Modules to give their outputs after say 300 picoseconds rather than 400 picoseconds.Obviously if I increase the operating frequency, some of the inputs in the testbench will give out erroneous outputs. My hypothesis is that the module that starts giving out erroneous answers first, has the algorithm.So my doubts are:1) Is it possible to increase the operating frequency of a Module in Verilog using Xilinx (some settings that I must enforce upon during synthesis or analysis). If not, is there a better tool that will be do my timing analysis?2) Is this approach viable? Short of doing a gate level synthesis using Cadence, is there anyway, I can find out the actual time delay analysis for each set of signed numbers for each gate using Verilog?",
        "accepted_answer": null,
        "all_answers": [
            "You are right in assuming that Xilinx always reports worst-case timing for the whole design, where clock-rates are concerned, Don't take the synthesis results as being very accurate - they can vary by quite a lot once you've placed and routed the design.I guess you could take the post-PAR Verilog netlist and simulate that with a variety of inputs using different simulated clock speeds - if there are slow paths which are not used for certain inputs, you should be able to run the simulated clock faster for those inputs.Sounds like a very time consuming task, and I'm not sure what the point is.  Where I come from (automotive) \"worst-case\" is the only number we can look at with any level of confidence!"
        ]
    },
    {
        "title": "SystemVerilog error with queue insert w/ another queue as argument",
        "question": "I have some queues declared like so:\n```\nstatic bit [127:0]   same_addr_mem_model [int][$]; \nstatic bit [127:0]   temp_addr_mem_model [int][$];\n```\n\nThen later on the line of code:\n```\nsame_addr_mem_model[write_addr].insert(0,temp_addr_mem_model[write_addr]); // write_addr is some int\n```\n\nAnd that line gives me the compiler error with Cadence IES:assignment operator type check failed (expecting datatype compatible with 'packed array' but found 'queue of packed array [127:0] of bit' instead).But as I've found documentation online it looks like a queue is a perfectly valid argument forinsert(). Any idea what is wrong here? This code compiles and runs with Synopsys VCS, by the way.",
        "accepted_answer": null,
        "all_answers": [
            "The function prototype forinsertis:\n```\nfunction void insert(input int index, input element_t item);\n```\n\nSo if you are creating a queue ofintsthen you cannot add a queue ofintsusinginsert.It's not uncommon for vendors to not implement all of the language spec, or implement vendor-specific features that are not in the spec.  This is a case though where is seems VCS is just wrong for allowing this. I would double-check that it's actually doing what you expect.Functions in SystemVerilog cannot be overloaded by argument type, so there would be no way to implement twoinsertfunctions, one taking the element type and the other taking a queue of elements.You should be able to get the equivalent behavior using assignment syntax.\n```\nsame_addr_mem_model[write_addr] = {temp_addr_mem_model[write_addr], same_addr_mem_model[write_addr]});\n```\n\nSee section 7.10.4 of the 2012 SystemVerilog spec."
        ]
    },
    {
        "title": "Sublime text: Adding symbols to a new language definition (syntax highlighting)",
        "question": "I have written syntax highlighting for a slightly unfamiliar language (Cadence SKILL) in sublime text 2.Its working like a charm, however I miss the feature of CTRL + R , which locates all the symbols (functions) in the present file in an easily accessible way.Can anyone please suggest how to tell Sublime Text where to look for a pattern of function (procedure) declaration?Thanks!",
        "accepted_answer": "Take a look atDefault/Symbol List.tmPreferences. You can create this preference file and specify scopes to include in the symbol list. You may also want to look atJava/Symbol List <some specifier>.tmPreferencesfor examples of a language specific symbol list. Alternatively, you can ensure the things that you want to include have the scopeentity.name.functionorentity.name.type.editYou will need to look at your color scheme file. These files are Plist, so you may want to use something likePlistJsonConverterto make it a little more readable (though this is more of a personal preference). In this file, you will see a number of dictionary entries. One of the keys to these entries is scope. When a matching scope is found as defined by your language definition. You will also see a \"settings\" key that defines details about color, font style, etc. Since you want different colors, you will need to apply different scopes. You will need to define a custom Symbol List preference file so everything gets included properly. The following is from the Java package.<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\">\n<plist version=\"1.0\">\n<dict>\n    <key>name</key>\n    <string>Symbol List: Classes</string>\n    <key>scope</key>\n    <string>source.java meta.class meta.class.identifier</string>\n    <key>settings</key>\n    <dict>\n        <key>showInSymbolList</key>\n        <integer>1</integer>\n    </dict>\n    <key>uuid</key>\n    <string>22E489AE-989E-4A76-9C18-89944CF5013D</string>\n</dict>\n</plist>You will define whatever scopes are being applied to the entries you want to appear in the list.",
        "all_answers": []
    },
    {
        "title": "C# to call Cadence Allegro with SKILL code function",
        "question": "I am trying to make some calls to Cadence Allegro from C#, I have some C++ examples but they are very incomplete.  I don't see anything on S/O with this, some Allegro... But if anyone has ever called up a Allegro PCB etc.. , can you point me in the right direction?  I have been looking on Cadence website.Looking to send \"SKILL .il\" code over from C# application to Cadence PCB / Editor etc.. for the .brd (board) files to show violations.",
        "accepted_answer": "So Cadence Systems has a dll called mpsc.dll, and there is a header file  mpsc.h in which there are many functions to call.This stuff does work, just very old and I will wrap it in C#",
        "all_answers": []
    }
]